{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "(\\[[^\\]]+\\])"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[PAD]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[MASK]": 3,
      "\n": 4,
      "#": 5,
      "+": 6,
      "-": 7,
      "/": 8,
      "0": 9,
      "1": 10,
      "2": 11,
      "3": 12,
      "4": 13,
      "6": 14,
      "7": 15,
      "8": 16,
      "=": 17,
      "@": 18,
      "B": 19,
      "C": 20,
      "F": 21,
      "H": 22,
      "I": 23,
      "N": 24,
      "O": 25,
      "P": 26,
      "R": 27,
      "S": 28,
      "[": 29,
      "\\": 30,
      "]": 31,
      "a": 32,
      "c": 33,
      "g": 34,
      "h": 35,
      "i": 36,
      "l": 37,
      "n": 38,
      "r": 39,
      "C]": 40,
      "2]": 41,
      "=O": 42,
      "[=O": 43,
      "[=O]": 44,
      "H1": 45,
      "H1]": 46,
      "[=": 47,
      "C@": 48,
      "[C@": 49,
      "[O": 50,
      "[O]": 51,
      "g2]": 52,
      "ng2]": 53,
      "ing2]": 54,
      "Ring2]": 55,
      "[Ring2]": 56,
      "h2]": 57,
      "ch2]": 58,
      "nch2]": 59,
      "anch2]": 60,
      "ranch2]": 61,
      "Branch2]": 62,
      "[C@@": 63,
      "[=N": 64,
      "[=N]": 65,
      "[C@H1]": 66,
      "[C@@H1]": 67,
      "[#": 68,
      "[Branch2]": 69,
      "F]": 70,
      "[F]": 71,
      "+1": 72,
      "+1]": 73,
      "S]": 74,
      "[S]": 75,
      "[=Branch2]": 76,
      "[#B": 77,
      "[#Br": 78,
      "[#Bra": 79,
      "[#Bran": 80,
      "[#Branc": 81,
      "[#Branch": 82,
      "[#Branch1": 83,
      "[#Branch1]": 84,
      "H1+1]": 85,
      "NH1+1]": 86,
      "[NH1+1]": 87,
      "[=R": 88,
      "[=Ri": 89,
      "[=Rin": 90,
      "[=Ring": 91,
      "[=Ring1": 92,
      "[=Ring1]": 93,
      "Cl": 94,
      "Cl]": 95,
      "[Cl]": 96,
      "NH1]": 97,
      "[NH1]": 98,
      "NH": 99,
      "[NH": 100,
      "[#Branch2]": 101,
      "2+1]": 102,
      "[NH2+1]": 103,
      "Br": 104,
      "[#C]": 105,
      "[/": 106,
      "-1": 107,
      "-1]": 108,
      "Br]": 109,
      "[Br]": 110,
      "[#N": 111,
      "[#N]": 112,
      "[/C]": 113,
      "[P": 114,
      "[P]": 115,
      "[C@@]": 116,
      "[C@]": 117,
      "[O-1]": 118,
      "an": 119,
      "ch": 120,
      "Ri": 121,
      "ng": 122,
      "1]": 123,
      "[\\": 124,
      "3+1]": 125,
      "[NH3+1]": 126,
      "N-1]": 127,
      "[N-1]": 128,
      "[\\C]": 129,
      "[=NH1+1]": 130,
      "[=S]": 131,
      "-Ri": 132,
      "-Ring": 133,
      "-Ring1]": 134,
      "I]": 135,
      "[I]": 136,
      "[/N": 137,
      "[/N]": 138,
      "[\\-Ring1]": 139,
      "[/S]": 140,
      "[/Cl]": 141,
      "[/-Ring1]": 142,
      "[\\N": 143,
      "[\\N]": 144,
      "[\\Cl]": 145,
      "[=NH": 146,
      "[=NH2+1]": 147,
      "[/NH1+1]": 148,
      "[S": 149,
      "H]": 150,
      "[H]": 151,
      "[/O": 152,
      "[/O]": 153,
      "[\\O": 154,
      "i]": 155,
      "[Si]": 156,
      "[\\O]": 157,
      "-Ring2]": 158,
      "[=Ring2]": 159,
      "[/C@": 160,
      "[\\-Ring2]": 161,
      "N+1]": 162,
      "[N+1]": 163,
      "@H1]": 164,
      "[\\C@": 165,
      "[\\S]": 166,
      "[S-1]": 167,
      "[/-Ring2]": 168,
      "[/C@@H1]": 169,
      "[/C@H1]": 170,
      "@]": 171,
      "[\\C@@H1]": 172,
      "[=N+1]": 173,
      "[\\C@H1]": 174,
      "B]": 175,
      "[B]": 176,
      "[/F]": 177,
      "@@]": 178,
      "CH1]": 179,
      "[CH1]": 180,
      "[S@@]": 181,
      "CH": 182,
      "[CH": 183,
      "0]": 184,
      "[S@]": 185,
      "[CH0]": 186,
      "[\\O-1]": 187,
      "[\\F]": 188,
      "[/Br]": 189,
      "[/C@]": 190,
      "[/O-1]": 191,
      "[\\C@]": 192,
      "[/C@@]": 193,
      "[\\NH1+1]": 194,
      "[\\Br]": 195,
      "[P@@]": 196,
      "[\\C@@]": 197,
      "[P@]": 198,
      "@+1]": 199,
      "[/I]": 200,
      "[S+1]": 201,
      "@@+1]": 202,
      "N@@+1]": 203,
      "[N@@+1]": 204,
      "N@+1]": 205,
      "[N@+1]": 206,
      "[/NH1]": 207,
      "[\\NH1]": 208,
      "[CH2]": 209,
      "H0]": 210,
      "[OH0]": 211,
      "[Sn": 212,
      "[Sn]": 213,
      "[=S": 214,
      "[\\I]": 215,
      "[/N+1]": 216,
      "[=S+1]": 217,
      "[/NH": 218,
      "[/NH2+1]": 219,
      "P]": 220,
      "[/OH0]": 221,
      "[=P]": 222,
      "[=S@]": 223,
      "[P+1]": 224,
      "[=S@@]": 225,
      "[/H]": 226,
      "[/P]": 227,
      "[\\H]": 228,
      "B-1]": 229,
      "[B-1]": 230,
      "[\\P]": 231,
      "[S@@+1]": 232,
      "[/S": 233,
      "C+1]": 234,
      "[C+1]": 235,
      "[S@+1]": 236,
      "[/Si]": 237,
      "[\\NH": 238,
      "[=O+1]": 239,
      "[/NH3+1]": 240,
      "[\\N+1]": 241,
      "[Si": 242,
      "[\\NH2+1]": 243,
      "[P@": 244,
      "[\\S": 245,
      "[NH0]": 246,
      "[\\OH0]": 247,
      "[P@@H1]": 248,
      "H1-1]": 249,
      "N@]": 250,
      "[N@]": 251,
      "n]": 252,
      "[\\Si]": 253,
      "[/Sn]": 254,
      "[Si@@]": 255,
      "CH1-1]": 256,
      "[CH1-1]": 257,
      "[SnH": 258,
      "[Si@]": 259,
      "@-1]": 260,
      "[=NH0]": 261,
      "BH": 262,
      "[BH": 263,
      "+2]": 264,
      "3-1]": 265,
      "[BH3-1]": 266,
      "[P@H1]": 267,
      "[\\B]": 268,
      "CH0]": 269,
      "C-1]": 270,
      "[C-1]": 271,
      "[/B]": 272,
      "[Sn@]": 273,
      "[O+1]": 274,
      "[P@+1]": 275,
      "[P@@+1]": 276,
      "[\\NH3+1]": 277,
      "@@-1]": 278,
      "[Sn@@]": 279,
      "17": 280,
      "4+2]": 281,
      "BH1-1]": 282,
      "[BH1-1]": 283,
      "[SnH4+2]": 284,
      "17O": 285,
      "17O]": 286,
      "B@-1]": 287,
      "B@@-1]": 288,
      "[B@-1]": 289,
      "[B@@-1]": 290,
      "[=B]": 291,
      "[=17O]": 292,
      "[/CH0]": 293,
      "[#N+1]": 294,
      "[SnH1]": 295,
      "[/S@]": 296,
      "[SnH2+1]": 297,
      "3]": 298,
      "[=CH0]": 299,
      "[Sn+2]": 300,
      "[/NH0]": 301,
      "[\\NH0]": 302,
      "@H1+1]": 303,
      "I+1]": 304,
      "[I+1]": 305,
      "[/S@@]": 306,
      "[P@@H1+1]": 307,
      "[\\S@]": 308,
      "+3]": 309,
      "N@@]": 310,
      "[N@@]": 311,
      "Br+1]": 312,
      "[Br+1]": 313,
      "[Sn+1]": 314,
      "[=Si]": 315,
      "[/S+1]": 316,
      "[\\Sn]": 317,
      "[#S]": 318,
      "18": 319,
      "2-1]": 320,
      "6+3]": 321,
      "@@H1]": 322,
      "H3]": 323,
      "OH1]": 324,
      "[17O]": 325,
      "[18": 326,
      "[=P": 327,
      "[/CH1]": 328,
      "[PH1]": 329,
      "[S@@-1]": 330,
      "[S@@H1]": 331,
      "[Sn+3]": 332,
      "[=S-1]": 333,
      "[/Si": 334,
      "[\\S+1]": 335,
      "[SnH2]": 336,
      "[SnH6+3]": 337,
      "[BH2-1]": 338,
      "[18OH1]": 339,
      "H2]": 340,
      "[#P]": 341,
      "[/CH": 342,
      "[/C+1]": 343,
      "[S@H1]": 344,
      "[SH3]": 345,
      "[Sn-1]": 346,
      "[SiH3]": 347,
      "[SiH2]": 348,
      "[=P@]": 349,
      "[=P@@]": 350,
      "[/Si@]": 351,
      "[/Si@@]": 352,
      "[/CH2]": 353
    },
    "merges": [
      "C ]",
      "2 ]",
      "= O",
      "[ =O",
      "[=O ]",
      "H 1",
      "H1 ]",
      "[ =",
      "C @",
      "[ C@",
      "[ O",
      "[O ]",
      "g 2]",
      "n g2]",
      "i ng2]",
      "R ing2]",
      "[ Ring2]",
      "h 2]",
      "c h2]",
      "n ch2]",
      "a nch2]",
      "r anch2]",
      "B ranch2]",
      "[C@ @",
      "[= N",
      "[=N ]",
      "[C@ H1]",
      "[C@@ H1]",
      "[ #",
      "[ Branch2]",
      "F ]",
      "[ F]",
      "+ 1",
      "+1 ]",
      "S ]",
      "[ S]",
      "[= Branch2]",
      "[# B",
      "[#B r",
      "[#Br a",
      "[#Bra n",
      "[#Bran c",
      "[#Branc h",
      "[#Branch 1",
      "[#Branch1 ]",
      "H1 +1]",
      "N H1+1]",
      "[ NH1+1]",
      "[= R",
      "[=R i",
      "[=Ri n",
      "[=Rin g",
      "[=Ring 1",
      "[=Ring1 ]",
      "C l",
      "Cl ]",
      "[ Cl]",
      "N H1]",
      "[ NH1]",
      "N H",
      "[ NH",
      "[# Branch2]",
      "2 +1]",
      "[NH 2+1]",
      "B r",
      "[# C]",
      "[ /",
      "- 1",
      "-1 ]",
      "Br ]",
      "[ Br]",
      "[# N",
      "[#N ]",
      "[/ C]",
      "[ P",
      "[P ]",
      "[C@@ ]",
      "[C@ ]",
      "[O -1]",
      "a n",
      "c h",
      "R i",
      "n g",
      "1 ]",
      "[ \\",
      "3 +1]",
      "[NH 3+1]",
      "N -1]",
      "[ N-1]",
      "[\\ C]",
      "[=N H1+1]",
      "[= S]",
      "- Ri",
      "-Ri ng",
      "-Ring 1]",
      "I ]",
      "[ I]",
      "[/ N",
      "[/N ]",
      "[\\ -Ring1]",
      "[/ S]",
      "[/ Cl]",
      "[/ -Ring1]",
      "[\\ N",
      "[\\N ]",
      "[\\ Cl]",
      "[=N H",
      "[=NH 2+1]",
      "[/ NH1+1]",
      "[ S",
      "H ]",
      "[ H]",
      "[/ O",
      "[/O ]",
      "[\\ O",
      "i ]",
      "[S i]",
      "[\\O ]",
      "- Ring2]",
      "[= Ring2]",
      "[/ C@",
      "[\\ -Ring2]",
      "N +1]",
      "[ N+1]",
      "@ H1]",
      "[\\ C@",
      "[\\ S]",
      "[S -1]",
      "[/ -Ring2]",
      "[/C@ @H1]",
      "[/C@ H1]",
      "@ ]",
      "[\\C@ @H1]",
      "[=N +1]",
      "[\\C@ H1]",
      "B ]",
      "[ B]",
      "[/ F]",
      "@ @]",
      "C H1]",
      "[ CH1]",
      "[S @@]",
      "C H",
      "[ CH",
      "0 ]",
      "[S @]",
      "[CH 0]",
      "[\\O -1]",
      "[\\ F]",
      "[/ Br]",
      "[/C@ ]",
      "[/O -1]",
      "[\\C@ ]",
      "[/C@ @]",
      "[\\ NH1+1]",
      "[\\ Br]",
      "[P @@]",
      "[\\C@ @]",
      "[P @]",
      "@ +1]",
      "[/ I]",
      "[S +1]",
      "@ @+1]",
      "N @@+1]",
      "[ N@@+1]",
      "N @+1]",
      "[ N@+1]",
      "[/ NH1]",
      "[\\ NH1]",
      "[CH 2]",
      "H 0]",
      "[O H0]",
      "[S n",
      "[Sn ]",
      "[= S",
      "[\\ I]",
      "[/N +1]",
      "[=S +1]",
      "[/ NH",
      "[/NH 2+1]",
      "P ]",
      "[/O H0]",
      "[= P]",
      "[=S @]",
      "[P +1]",
      "[=S @@]",
      "[/ H]",
      "[/ P]",
      "[\\ H]",
      "B -1]",
      "[ B-1]",
      "[\\ P]",
      "[S @@+1]",
      "[/ S",
      "C +1]",
      "[ C+1]",
      "[S @+1]",
      "[/S i]",
      "[\\ NH",
      "[=O +1]",
      "[/NH 3+1]",
      "[\\N +1]",
      "[S i",
      "[\\NH 2+1]",
      "[P @",
      "[\\ S",
      "[NH 0]",
      "[\\O H0]",
      "[P@ @H1]",
      "H1 -1]",
      "N @]",
      "[ N@]",
      "n ]",
      "[\\S i]",
      "[/S n]",
      "[Si @@]",
      "C H1-1]",
      "[ CH1-1]",
      "[Sn H",
      "[Si @]",
      "@ -1]",
      "[=NH 0]",
      "B H",
      "[ BH",
      "+ 2]",
      "3 -1]",
      "[BH 3-1]",
      "[P @H1]",
      "[\\ B]",
      "CH 0]",
      "C -1]",
      "[ C-1]",
      "[/ B]",
      "[Sn @]",
      "[O +1]",
      "[P @+1]",
      "[P @@+1]",
      "[\\NH 3+1]",
      "@ @-1]",
      "[Sn @@]",
      "1 7",
      "4 +2]",
      "B H1-1]",
      "[ BH1-1]",
      "[SnH 4+2]",
      "17 O",
      "17O ]",
      "B @-1]",
      "B @@-1]",
      "[ B@-1]",
      "[ B@@-1]",
      "[= B]",
      "[= 17O]",
      "[/ CH0]",
      "[#N +1]",
      "[Sn H1]",
      "[/S @]",
      "[SnH 2+1]",
      "3 ]",
      "[= CH0]",
      "[Sn +2]",
      "[/NH 0]",
      "[\\NH 0]",
      "@ H1+1]",
      "I +1]",
      "[ I+1]",
      "[/S @@]",
      "[P@ @H1+1]",
      "[\\S @]",
      "+ 3]",
      "N @@]",
      "[ N@@]",
      "Br +1]",
      "[ Br+1]",
      "[Sn +1]",
      "[=S i]",
      "[/S +1]",
      "[\\S n]",
      "[# S]",
      "1 8",
      "2 -1]",
      "6 +3]",
      "@ @H1]",
      "H 3]",
      "O H1]",
      "[ 17O]",
      "[ 18",
      "[= P",
      "[/ CH1]",
      "[P H1]",
      "[S @@-1]",
      "[S @@H1]",
      "[Sn +3]",
      "[=S -1]",
      "[/S i",
      "[\\S +1]",
      "[SnH 2]",
      "[SnH 6+3]",
      "[BH 2-1]",
      "[18 OH1]",
      "H 2]",
      "[# P]",
      "[/ CH",
      "[/ C+1]",
      "[S @H1]",
      "[S H3]",
      "[Sn -1]",
      "[Si H3]",
      "[Si H2]",
      "[=P @]",
      "[=P @@]",
      "[/Si @]",
      "[/Si @@]",
      "[/CH 2]"
    ]
  }
}