{
    "[O]": 141785,
    "[C]": 1626144,
    "[N]": 340964,
    "[=N]": 158879,
    "[Branch1]": 311478,
    "[=C]": 714736,
    "[Ring1]": 481636,
    "[=Branch1]": 196458,
    "[/C]": 11666,
    "[\\C]": 2641,
    "[Ring2]": 202920,
    "[#Branch2]": 39215,
    "[Branch2]": 137932,
    "[#Branch1]": 58665,
    "[=O]": 99657,
    "[=Branch2]": 56293,
    "[F]": 53002,
    "[#C]": 35195,
    "[S]": 53376,
    ".": 1140,
    "[Cl]": 21693,
    "[C@@H1]": 16290,
    "[NH1]": 30014,
    "[#N]": 5094,
    "[P]": 25325,
    "[C@H1]": 20335,
    "[=Ring1]": 20381,
    "[Br]": 5061,
    "[/N]": 1373,
    "[=Ring2]": 5974,
    "[N+1]": 1051,
    "[O-1]": 1467,
    "[=N+1]": 258,
    "[I]": 520,
    "[\\O]": 333,
    "[\\N]": 510,
    "[OH0]": 15,
    "[C@]": 1227,
    "[S+1]": 172,
    "[C@@]": 873,
    "[=P]": 39,
    "[C-1]": 132,
    "[#N+1]": 132,
    "[=S]": 904,
    "[Se]": 55,
    "[/O]": 200,
    "[Branch3]": 11,
    "[/C@@H1]": 21,
    "[Li+1]": 7,
    "[-\\Ring2]": 3,
    "[\\NH1]": 29,
    "[=N-1]": 25,
    "[NH1+1]": 2,
    "[N-1]": 11,
    "[2H]": 48,
    "[Na+1]": 45,
    "[\\S]": 117,
    "[/S]": 33,
    "[I-1]": 9,
    "[Br-1]": 5,
    "[Si]": 31,
    "[-/Ring2]": 81,
    "[/-Ring1]": 1,
    "[\\-Ring1]": 1,
    "[Cl-1]": 13,
    "[N@]": 1,
    "[/N+1]": 23,
    "[B]": 20,
    "[\\Cl]": 1,
    "[/C@H1]": 14,
    "[/Cl]": 4,
    "[\\F]": 8,
    "[Au]": 2,
    "[Zn+2]": 2,
    "[/F]": 2,
    "[Hg]": 1,
    "[=S+1]": 5,
    "[11CH3]": 1,
    "[/NH1]": 2,
    "[S@+1]": 18,
    "[\\C@H1]": 2,
    "[S@@+1]": 15,
    "[K+1]": 4,
    "[#C-1]": 3,
    "[N@@+1]": 1,
    "[S@@]": 1,
    "[\\C@@H1]": 3,
    "[/C@]": 3,
    "[B-1]": 1,
    "[C][=C]": 515907,
    "[C][C]": 1900425,
    "[C][=C][C][=C]": 686644,
    "[Branch1][C]": 729176,
    "[Ring2][Ring1]": 844025,
    "[=Branch1][C]": 2750103,
    "[N][C]": 1974610,
    "[C][=N]": 1018312,
    "[Ring1][=Branch1]": 1036254,
    "[C][Branch1]": 1084403,
    "[C][=C][Ring1]": 2227350,
    "[Branch2][Ring1]": 1160870,
    "[N][=C]": 4753192,
    "[=Branch1][C][=O]": 3726945,
    "[C][=C][C]": 3806607,
    "[Branch1][C][C]": 2564814,
    "[N][C][C]": 1303405,
    "[=C][Ring1]": 1321195,
    "[C][C][C]": 14610222,
    "[N][C][=C][C][=C]": 1357044,
    "[Branch1][C][F]": 1388166,
    "[O][C]": 2805320,
    "[Ring1][#Branch1]": 1412904,
    "[Branch2][Ring2]": 8648514,
    "[C][=C][Ring2][Ring1]": 2918976,
    "[C][N]": 4380024,
    "[C][Ring1]": 7300470,
    "[C][O]": 1468791,
    "[C][Branch1][C]": 1471516,
    "[O][C][C]": 7442680,
    "[C][=C][Ring1][=Branch1]": 7539420,
    "[=C][Ring2][Ring1]": 1517344,
    "[C][=C][Branch1]": 1532825,
    "[N][C][=Branch1][C][=O]": 3112704,
    "[N][C][=N]": 6260240,
    "[=N][C]": 6279296,
    "[C][=C][C][=C][C]": 3156912,
    "[N][Branch1]": 1578747,
    "[N][C][=C]": 3162458,
    "[C][=C][C][=C][Branch1]": 11146275,
    "[C][=Branch1][C][=O]": 11247334,
    "[C][Branch2][Ring1]": 3217288,
    "[O][=C]": 1611075,
    "[O][C][=C][C][=C]": 17823069,
    "[C][C][C][C]": 1620449,
    "[C][=C][C][=N]": 6509040,
    "[=C][C]": 1628576,
    "[Ring1][Branch1]": 8185595,
    "[Ring2][Ring2]": 8227660,
    "[C][=C][N][=C]": 1646583,
    "[Ring1][=Branch2]": 9899712,
    "[C][=C][Ring1][#Branch1]": 1657521,
    "[C][C][Ring1]": 1658181,
    "[Branch1][C][Cl]": 1665330,
    "[Branch1][C][N]": 3332028,
    "[Branch1][C][O]": 5001330,
    "[=N][Ring2][Ring1]": 6676032,
    "[C][=C][C][Branch1]": 6716516,
    "[Branch1][=Branch2]": 3367486,
    "[N][Branch1][C][C]": 20307732,
    "[C][=C][C][=C][Branch2][Ring1]": 6792448,
    "[=N][Ring1]": 6819284,
    "[=Branch2][C]": 1709447,
    "[Ring1][C]": 13732488,
    "[N][Ring1]": 5161566,
    "[C][=C][C][=C][C][=C][Ring1][=Branch1]": 1729704,
    "[Ring1][O]": 1730241,
    "[Ring1][S]": 8658875,
    "[C][=Ring1]": 5195703,
    "[Ring1][#C]": 36383172,
    "[C][Ring2][Ring1]": 8680225,
    "[=N][C][=C]": 5211831,
    "[Ring1][=N]": 3475820,
    "[N][=C][Ring2][Ring1]": 6966596,
    "[S][C]": 12198984,
    "[Branch1][C][F][Branch1][C][F]": 5254020,
    "[C][Branch1][=Branch2]": 7012612,
    "[C][C][Branch1][C][C]": 8784875,
    "[C][=C][C][Branch2][Ring1]": 3522028,
    "[N][=C][Branch1]": 8829810,
    "[Branch1][=C]": 5305686,
    "[=Branch1][Ring2]": 3544868,
    "[C][=N][C]": 5324727,
    "[N][=C][Ring1]": 8885930,
    "[Ring1][=Branch1][C]": 3561406,
    "[C][C][=C][C][=C]": 14265152,
    "[N][C][=C][C][=C][Branch1]": 1786256,
    "[C][C][=N]": 7156768,
    "[Ring1][=C]": 3579482,
    "[C][=C][Ring1][=Branch1][C]": 7181440,
    "[/C][=C]": 1800370,
    "[Branch2][Branch1]": 3601386,
    "[=N][N]": 7211276,
    "[Ring1][#Branch2]": 5413449,
    "[Branch1][Ring1]": 5415525,
    "[N][Ring2][Ring1]": 1807075,
    "[Ring2][Ring1][Ring1]": 56074877,
    "[#Branch2][C]": 7245756,
    "[=Branch1][C][=O][=Branch1][C][=O]": 1814516,
    "[C][=C][Branch2][Ring1]": 1816379,
    "[N][C][C][N]": 12717824,
    "[=C][Ring1][#Branch1]": 7289360,
    "[Ring1][Ring1]": 1822782,
    "[C][N][C][C]": 3647620,
    "[C][=C][C][=C][C][=C][Ring1]": 32853402,
    "[O][C][=Branch1][C][=O]": 3653080,
    "[C][C][Ring2][Ring1]": 5486877,
    "[Branch1][C][C][C]": 7317328,
    "[C][C][=C]": 9153195,
    "[Branch1][C][F][F]": 10987596,
    "[C][Branch1][C][F]": 7332028,
    "[Ring2][Ring1][Ring2]": 7337340,
    "[N][=C][N][=C]": 18367460,
    "[C][C][C][Ring1]": 12862395,
    "[=C][Ring1][=Branch1]": 14733424,
    "[N][C][C][O][C][C]": 7383264,
    "[N][C][C][C]": 7387424,
    "[C][C][=Branch1][C][=O]": 20360989,
    "[Ring1][P]": 9264345,
    "[C][=C][C][=C][Branch2][Ring2]": 20420059,
    "[C][=C][C][=C][N][=C]": 1859221,
    "[Branch2][Ring1][Ring2]": 3721986,
    "[C][=C][Ring1][#Branch2]": 1861980,
    "[N][N][=C]": 1862032,
    "[C][=C][C][=C][C][Branch1]": 5594334,
    "[Branch1][C][N][=O]": 16819434,
    "[Branch1][C][F][Branch1][C][F][F]": 1869437,
    "[C][=C][C][Branch2][Ring2]": 9358800,
    "[=N][NH1]": 1872452,
    "[Branch1][C][O][C]": 1872587,
    "[=Branch1][C][=O][N][C][=C][C][=C]": 1873405,
    "[=C][C][=N]": 5626461,
    "[C][Branch1][C][Cl]": 3754968,
    "[=Ring2][Ring1]": 5638557,
    "[C][C][Ring1][#Branch1]": 9414070,
    "[Ring2][Ring1][#Branch1]": 5652963,
    "[=C][Ring1][Branch2]": 16983180,
    "[=C][C][=C][Ring1]": 11331612,
    "[C][C@H1]": 9453520,
    "[=C][Ring1][#Branch2]": 3784886,
    "[N][C][=Branch1][C][=O][C][=C][C][=C]": 1894463,
    "[Ring1][Branch2]": 3789996,
    "[C][Branch2]": 9477830,
    "[=C][C][=C]": 13271398,
    "[C][C][O]": 1898060,
    "[Ring2][C]": 3799492,
    "[C][=C][NH1]": 5706090,
    "[C][=C][C][=C][C][Branch2][Ring1]": 3809802,
    "[N][C][=C][C][=C][C][=C][Ring1][=Branch1]": 9527140,
    "[Branch2][C][C]": 7627976,
    "[N][C@H1]": 1910020,
    "[Branch1][#Branch2]": 1910494,
    "[Branch2][C]": 11473524,
    "[N][C][=N][C][=N]": 5740584,
    "[C][C@@H1]": 15323464,
    "[C][=N][C][Branch1]": 5754000,
    "[C@H1][C][C]": 1919906,
    "[Branch1][C][F][C][=C][Ring1][#Branch1]": 3843910,
    "[C][=N][Ring2][Ring1]": 13465809,
    "[=Branch2][C][=C][C][=C]": 5771319,
    "[#C][C]": 7700940,
    "[O][C][C][C]": 9626225,
    "[Branch1][C][C][C][C]": 9629695,
    "[N][C][C][C][C]": 26976474,
    "[=C][C][=C][Ring2][Ring1]": 7708224,
    "[Ring1][=Branch1][C][=C][Ring1]": 1929528,
    "[Branch2][Ring1][=Branch1]": 7722692,
    "[C][=C][C][=C][Ring1][#Branch1]": 7728396,
    "[C][=C][C][=N][C][=C][Ring1][=Branch1]": 5798520,
    "[C][=C][C][Branch1][C]": 1933857,
    "[N][=N]": 3868656,
    "[=Branch1][C][=O][N]": 21284780,
    "[C][NH1]": 5805978,
    "[Ring1][C][#N]": 3877984,
    "[NH1][C][=C][C]": 1939871,
    "[Branch1][C][Br]": 7768400,
    "[=C][Ring1][=Branch2]": 15536904,
    "[Branch2][Ring2][Ring1]": 7775408,
    "[N][C][=C][Branch1]": 7782300,
    "[C][C][N]": 7782468,
    "[Ring1][=Branch1][=C]": 1946664,
    "[C][C][C@H1]": 1947966,
    "[C][N][Branch1][C][C]": 5844513,
    "[N][C][=C][C][=C][Branch1][C][F]": 11693622,
    "[=Branch1][C][=O][N][C][C]": 5848230,
    "[S][=Branch1][C][=O][=Branch1][C][=O]": 1950015,
    "[C][=C][Ring2][Ring1][Ring1]": 7806676,
    "[C][=C][C][=C][Branch1][C][F]": 1951902,
    "[Ring1][N]": 17569179,
    "[C][=C][Ring1][=N]": 17583606,
    "[C][Branch2][Ring2]": 25402130,
    "[Ring1][Branch1][C]": 9770395,
    "[Ring2][Ring1][Branch2]": 19551540,
    "[C][Branch1][C][C]": 1955873,
    "[C][=C][Branch1][=Branch1][C]": 29355165,
    "[C][=C][Branch1][C]": 9788005,
    "[C][=N][C][=N]": 39175660,
    "[NH1][N][=C]": 3917760,
    "[=Ring1][Branch1]": 3918530,
    "[Ring2][Ring1][=Branch1]": 5879988,
    "[N][C][=C][C][=C][C]": 3921740,
    "[C][S]": 11768358,
    "[C@H1][Branch1]": 3923486,
    "[N][C@@H1]": 1961881,
    "[#Branch1][C]": 5885880,
    "[Branch1][C][N][C]": 1963817,
    "[N][C][C][N][Branch1][C][C]": 17689032,
    "[C][=C][Ring1][=Branch2]": 5896524,
    "[C][=C][Ring1][S]": 1967064,
    "[N][=O]": 1967610,
    "[N][C][=N][C][=C]": 5904531,
    "[C][=C][Ring1][#C]": 5904627,
    "[=Branch1][C][=O][=O]": 5909472,
    "[O][C][C][Ring1][=Branch1]": 1970109,
    "[C][=C][C][=C][C][=Branch1][Ring2]": 1971116,
    "[N][C][=Branch1][C][=O][N][C][=C][C][=C]": 1971794,
    "[Branch1][=N]": 7887532,
    "[Branch2][Ring1][#Branch2]": 21693111,
    "[N][#C]": 5918229,
    "[=C][Branch1]": 9869135,
    "[Branch2][Ring1][Ring1]": 11851182,
    "[O][C][=C][C][=C][Branch2][Ring1]": 9880465,
    "[O][C][=C]": 5929395,
    "[=N][N][C][=C][C][=C]": 3956650,
    "[C][N][C][=Branch1][C][=O]": 39590960,
    "[C][Branch1][#Branch2]": 23765832,
    "[O][C][=N]": 7922084,
    "[Ring1][=Branch1][=C][Ring1]": 5942349,
    "[C][Ring1][Branch1]": 15848248,
    "[Ring2][Ring2][Ring1]": 9907560,
    "[C][Branch1][C][C][Branch1][C][C]": 15855136,
    "[=C][Ring1][P]": 1982760,
    "[C][=C][Ring1][P]": 3968654,
    "[N][=Ring1]": 5954838,
    "[C][=C][Ring2][Ring1][=Branch1]": 1986825,
    "[Branch2][Ring1][Branch2]": 5960688,
    "[=Branch2][C][Branch1][C][F][Branch1][C][F][F]": 5966664,
    "[C][Branch1][=C]": 1990138,
    "[C][=C][C][=C][C][=C][Ring1][=Branch1][C]": 1990985,
    "[C@@H1][Branch1]": 9959050,
    "[C][=C][Ring1][Branch2]": 1992579,
    "[=N][C][=N]": 7970596,
    "[Branch2][Ring1][#Branch1]": 13956740,
    "[=C][Ring1][#C]": 15950992,
    "[Branch1][C][Cl][C][=C][Ring1][#Branch1]": 17951139,
    "[=Branch1][C][Branch1][C][N][=O]": 11980764,
    "[C][=C][C][Branch1][C][F]": 17987238,
    "[C][=Branch1][C][=O][N][C][C]": 6001374,
    "[C][=C][C][=C][C][Branch2][Ring2]": 30038760,
    "[N][C][=C][C]": 2003466,
    "[C][=C][Ring2][Ring1][#Branch1]": 12027606,
    "[Ring2][Ring1][=Branch2]": 8021828,
    "[Ring2][C][C]": 6018723,
    "[Ring2][Ring1][#Branch2]": 14049630,
    "[=Branch1][C][=Branch1][C][=O]": 8030932,
    "[C][=C][Ring2][Ring1][=Branch2]": 4016896,
    "[P][C]": 10043985,
    "[C][=C][Ring1][=C]": 10048175,
    "[O][=C][Branch2][Ring1]": 4021086,
    "[Branch2][Ring2][#Branch1]": 4021478,
    "[N][N][C][C]": 8045484,
    "[C][=C][C][=C][C][=N]": 10057310,
    "[C][=C][Ring2][Ring1][Branch2]": 10059810,
    "[=C][C][Branch1]": 2012235,
    "[Branch2][Ring2][Ring2]": 4026680,
    "[=C][Ring2][Ring1][Ring2]": 2013849,
    "[N][C][=C][C][=C][Branch2][Ring1]": 4029422,
    "[S][Branch1][C][C]": 30248025,
    "[Branch1][O]": 4034284,
    "[Ring2][Ring1][Branch1]": 6051786,
    "[C][=C][Branch2][Ring2]": 6053196,
    "[Ring2][Ring1][#C]": 4036480,
    "[C][O][C][=C][C][=C]": 2018260,
    "[#C][C][=C][C][=C]": 22209099,
    "[N][=C][Branch2][Ring1]": 10096670,
    "[N][C][=C][C][Branch1]": 4042214,
    "[N][C][=C][C][=C][C][Branch1]": 18192159,
    "[C][=C][C][=C][Branch1][=Branch2]": 46494776,
    "[C][=Branch1][C][=O][N][C][=C][C][=C]": 14152159,
    "[=Branch1][Ring2][=C][Ring1][=Branch1]": 8091076,
    "[N][C][=C][N][=C]": 12145398,
    "[S][Ring2][Ring1]": 16197656,
    "[C][Ring1][#C]": 8101348,
    "[Ring2][Ring1][C]": 10130255,
    "[C][=C][N]": 16210896,
    "[N][C][C][N][C][C]": 10137645,
    "[=C][Ring1][S]": 12173112,
    "[N][C][C][O][C][C][Ring1][=Branch1]": 4060656,
    "[Ring1][Ring2]": 6092976,
    "[NH1][Ring2][Ring1]": 14217490,
    "[O][C][O]": 2032000,
    "[=N][C][Branch1]": 22362868,
    "[N][=C][Ring1][=Branch1]": 20332160,
    "[Branch2][Ring2][Branch1]": 16270720,
    "[Branch1][C][O][C][=C][Ring1][#Branch1]": 6106188,
    "[C][=N][C][Branch2][Ring1]": 16291296,
    "[Branch2][Ring2][Branch2]": 6111204,
    "[C][=C][S]": 14267561,
    "[N][C][C][C][C][C]": 10195110,
    "[C][=C][Ring2][Ring1][#Branch2]": 6121149,
    "[C][Branch2][Ring1][Ring2]": 16331152,
    "[C][C][C][N][C][C]": 10209265,
    "[O][C][=C][C][=N]": 8169924,
    "[S][C][=N]": 14299726,
    "[Ring1][=Branch1][=N][Ring1]": 18397062,
    "[C][Branch1][P]": 8179960,
    "[C][=Branch1][C][=O][N][C]": 4092158,
    "[Ring1][#Branch1][=C]": 24553080,
    "[C][=N][C][=C]": 10231180,
    "[Branch1][C][=Branch1][C][=O]": 2047562,
    "[Ring2][Ring1][S]": 12287514,
    "[Ring1][=Branch1][C][C]": 24578064,
    "[C][=C][Branch1][=Branch2]": 6147972,
    "[N][C][=Branch1][C][=O][C]": 41005980,
    "[=C][Ring2][Ring1][#Branch1]": 20513400,
    "[Branch2][Ring1][=Branch2]": 8205528,
    "[C][=C][Ring1][N]": 10261420,
    "[C][=C][Ring2][Ring1][Branch1]": 2053013,
    "[N][C][=C][C][=N]": 18480726,
    "[N][C][=C][C][=C][Branch1][=Branch2]": 14375543,
    "[C][=C][Ring2][Ring1][Ring2]": 4109948,
    "[N][C][C][C][Ring1]": 2055994,
    "[C][=C][Ring1][O]": 10283005,
    "[N][C][=N][C][Branch1]": 4114352,
    "[Branch1][C][C][Branch1][C][C]": 2057204,
    "[N][C][=N][C][=C][C][Branch1]": 4115700,
    "[C][=C][Ring2][Ring2]": 8234680,
    "[C][C][C][Ring1][Ring1]": 2059036,
    "[C][C][C][C][C]": 4119986,
    "[Branch2][Ring1][#C]": 43261197,
    "[O][=C][Branch1]": 2060590,
    "[Ring2][Ring2][Ring2]": 4121586,
    "[Ring2][Ring1][P]": 10306225,
    "[=N][C][=Branch1][C][=O]": 4122882,
    "[O][N][C][=Branch1][C][=O]": 8246676,
    "[C][=C][C][=C][Branch1][#Branch2]": 6188601,
    "[C][Branch1][C][Br]": 51574500,
    "[Ring2][Ring1][=C]": 12382266,
    "[Branch2][Ring2][#Branch2]": 2063868,
    "[Branch2][Ring2][=Branch1]": 4128090,
    "[=Branch1][C][Branch1][C][C]": 4128822,
    "[C][=C][Branch1][C][F]": 30974865,
    "[N][C][Branch1]": 8260708,
    "[N][=Ring2]": 10327970,
    "[NH1][C][=Ring1]": 14467698,
    "[N][Branch2][Ring2]": 4134192,
    "[NH1][C][=N]": 4134724,
    "[O][C][=C][C][=C][C][=C][Ring1][=Branch1]": 6203529,
    "[=N][C][=C][Ring2][Ring1]": 18611487,
    "[C][=C][C][=C][C][=Branch1][Ring2][=C][Ring1][=Branch1]": 22754193,
    "[N][C][C][N][Branch1][C][C][C][C][Ring1][#Branch1]": 12422904,
    "[C][=C][Branch1][C][Cl]": 14494130,
    "[N][C][=N][C][=C][Branch1]": 2070956,
    "[N][Branch1][C][C][C][C]": 4142270,
    "[C][C][Ring2][Ring2]": 18649566,
    "[Ring1][=Branch1][=N]": 4145524,
    "[=Ring1][Branch1][C]": 18661392,
    "[C][N][C][=N]": 8296560,
    "[Ring1][O][C]": 18672678,
    "[C][Branch1][=N]": 12448638,
    "[N][Branch1][=Branch2]": 20754330,
    "[=C][Ring2][Ring1][Ring1]": 10382525,
    "[Branch1][#Branch1]": 4153058,
    "[#Branch1][C][C]": 10383655,
    "[/C][=C][/C]": 2077650,
    "[=N][Ring1][#C]": 2078223,
    "[C][Ring1][=C]": 4158232,
    "[Ring2][Ring1][=N]": 14554610,
    "[C][Branch1][S]": 6238287,
    "[=Branch1][C][=O][N][C]": 20797770,
    "[Branch1][S]": 22879604,
    "[O][N][C]": 31211955,
    "[C][=C][C][=C][C][Branch1][C][F]": 12488472,
    "[C][Ring1][=Branch2]": 2081944,
    "[N][C][=N][C][=C][C]": 22907027,
    "[C][Branch1][C][O]": 22911372,
    "[=C][Ring2][Ring1][Branch2]": 14583114,
    "[N][C][C][N][Branch1]": 8335316,
    "[C][=C][Branch1][C][C]": 18757161,
    "[Branch2][Ring1][Branch1]": 2084364,
    "[Branch2][Ring2][=Branch2]": 12510408,
    "[C][N][C]": 2085086,
    "[N][C][C@@H1]": 6256512,
    "[=C][Ring2][Ring1][#Branch2]": 31295295,
    "[C][=C][N][Branch1]": 8345736,
    "[=N][Ring2][Ring1][Ring2]": 14611450,
    "[Branch1][C][Cl][=C]": 14617421,
    "[C][Branch1][C][Cl][=C][Ring1][#Branch1]": 8357952,
    "[N][Ring1][=Branch2]": 10451245,
    "[N][C][=C][C][=C][Branch1][C][F][C][=C][Ring1][#Branch1]": 14640290,
    "[C][C][N][C]": 39747734,
    "[C][=N][Ring1][=Branch1]": 18828252,
    "[Branch1][N]": 12553878,
    "[S][C][=Ring1]": 31388355,
    "[Branch1][Branch2]": 2092686,
    "[N][Ring1][Branch1][C]": 25120584,
    "[Branch2][C][=N]": 14659736,
    "[C][=N][NH1]": 4188792,
    "[=N][Ring1][S]": 16763464,
    "[C][=Ring1][Branch1]": 44010813,
    "[=C][Ring1][O]": 4191670,
    "[C][O][C][C]": 16769128,
    "[Branch1][C][O][C][C]": 16770224,
    "[C][=C][Ring2][Ring1][O]": 10482280,
    "[N][C][C][N][Branch2][Ring2]": 6291573,
    "[C][=C][C][=N][C][Branch1]": 8390724,
    "[N][C][=N][C][Branch2][Ring1]": 16787192,
    "[=N][Ring1][=Branch1]": 16789944,
    "[S][Ring1]": 4198066,
    "[Ring1][=Branch1][=C][Ring1][#Branch2]": 16803200,
    "[C][Ring1][P]": 6302124,
    "[=C][Ring2][Ring2]": 8405224,
    "[Branch2][N][C][=Branch1][C][=O]": 23119547,
    "[C][C][N][Branch1]": 6305484,
    "[C][O][C][=C][C][=C][Branch2][Ring1]": 33641136,
    "[N][Branch1][C][C][C][=Branch1][C][=O]": 6309771,
    "[N][Branch1][C][C][C]": 42081340,
    "[C][Branch1][C][Cl][=C][Ring1][Branch2]": 2104704,
    "[N][C][C][C][C][Ring1][Branch1]": 56838510,
    "[=Ring1][=Branch2]": 10529175,
    "[N][C][=Branch1][C][=O][N][C][C]": 12636654,
    "[C][C][C][N][C]": 21069370,
    "[=C][C][C]": 16858600,
    "[N][C][C][=C]": 12644628,
    "[/C][=C][\\C]": 4216104,
    "[N][=C][Ring1][#Branch1]": 4217358,
    "[=C][C][=C][Ring1][#Branch1]": 2109027,
    "[N][C][C][=C][C][=C]": 8436368,
    "[O][C][=C][C][=C][Branch2][Ring2]": 12655590,
    "[N][Branch2][Ring1]": 21097020,
    "[N][C][=C][C][=C][C][Branch2][Ring1]": 18990486,
    "[N][=C][Ring1][S]": 4221296,
    "[C@@H1][Branch1][C][C]": 8444172,
    "[#C][N][C][=N]": 12669330,
    "[C][Branch1][#C]": 6335742,
    "[C][Ring1][S]": 2112496,
    "[C][=C][C][=C][Branch1][C][F][C][=C][Ring1][#Branch1]": 10567605,
    "[C][=C][C][Branch1][=Branch2]": 42284020,
    "[N][C][Branch1][C][C]": 2114391,
    "[C][=C][C][=C][Ring1][=Branch1]": 2114757,
    "[Branch1][C][F][C][=C][C][=C][Ring1][#Branch1]": 4231076,
    "[=C][N][=C][Ring2][Ring1]": 4232308,
    "[N][C][C][C][Branch1]": 6350634,
    "[N][C][=C][C][Branch2][Ring1]": 19060713,
    "[O][C][C][O]": 10593040,
    "[O][C][Branch1]": 40257960,
    "[C][=C][Branch1][=Branch1][C][Branch1][C][N][=O]": 4239744,
    "[C][=C][Branch1][C][N]": 44521071,
    "[C][=C][C][=C][Ring1][#Branch1][F]": 4240754,
    "[O][Ring2][Ring1]": 12724674,
    "[=C][\\C]": 6362985,
    "[N][C][C][N][Branch2][Branch1]": 10610560,
    "[N][=C][N][=C][Ring1][#Branch1]": 2122614,
    "[N][N][C][=Branch1][C][=O]": 2122623,
    "[N][=C][N][=C][Ring2][Ring1]": 55215082,
    "[N][C][C][C][C][Ring1]": 2124336,
    "[/C][=Branch1]": 10622835,
    "[NH1][C][Branch1]": 4249382,
    "[S][Branch1][C][C][=Branch1][C][=O][=O]": 4251852,
    "[C][=C][C][=C][N][=C][Ring1][=Branch1]": 6378993,
    "[C@H1][C][C][C@H1]": 2126807,
    "[=C][Ring2][Ring1][=Branch2]": 21276620,
    "[=N][N][Ring1]": 6385485,
    "[C][Branch1][O]": 25542276,
    "[C][=C][C][=N][C][Branch2][Ring1]": 6387303,
    "[N][C][=Branch1][C][=O][C][=C][C][=C][Branch1]": 31943325,
    "[Ring1][C][O]": 23429736,
    "[N][C][C][O][C][C][Ring1][=Branch1][C][=C][Ring1]": 8523176,
    "[Branch2][C][C][=N]": 14920024,
    "[Branch2][Ring1][O]": 6395406,
    "[Branch2][Ring1][=C]": 2132169,
    "[=Branch1][C][=O][O-1]": 42655460,
    "[=Ring1][Branch1][C][C]": 4265998,
    "[=Branch1][C][=N]": 4266252,
    "[=C][Ring1][=Branch1][C]": 6400470,
    "[=N][Ring2][Ring1][Ring1]": 14938448,
    "[N][Branch1][C][C][C][=Ring1]": 17076096,
    "[NH1][C][Branch2][Ring1]": 2135312,
    "[C][=C][C][=C][Ring1][#Branch1][Cl]": 38453382,
    "[C][Branch2][Ring1][Branch1]": 10683335,
    "[C][=C][Ring1][#Branch1][F]": 29921948,
    "[N][C][N][=C]": 44889600,
    "[S][N][C][=Branch1][C][=O]": 14965013,
    "[Branch2][Ring1][P]": 4276414,
    "[=N][Ring1][P]": 10695250,
    "[C][=N][C][=N][C]": 6418674,
    "[C][Branch2][Ring1][Ring1]": 8558800,
    "[#Branch2][C][=Branch1][C][=O]": 4279968,
    "[N][C][=N][C][=C][C][Branch2][Ring1]": 8563404,
    "[C][=C][C][=C][C][=C][Ring1][=Branch1][Cl]": 10707840,
    "[=Branch1][Ring2][=N]": 6425256,
    "[Branch1][Ring1][C][O]": 2141807,
    "[C][=C][C][Branch1][C][Cl]": 6425493,
    "[Branch1][#C]": 4283698,
    "[C][C][C@@H1]": 8569300,
    "[C][=C][Ring2][Ring1][#C]": 2143118,
    "[#C][N][C][=Branch1][C][=O]": 4286330,
    "[C][=C][Ring2][Ring1][=N]": 47157242,
    "[F][=C]": 4287286,
    "[C][C][Branch1][C][C][Branch1][C][C]": 23581294,
    "[=C][C][=Branch1][C][=O]": 12863958,
    "[=C][Ring2][Ring1][=Branch1]": 19302228,
    "[C@H1][Branch1][C][C]": 2145186,
    "[=Branch1][C][=O][O]": 4291012,
    "[/C][=C][/C][=C]": 15021601,
    "[C][Branch1][Ring1][O]": 2146095,
    "[Ring2][Ring1][O]": 10732620,
    "[C][Branch1][C][F][Branch1][C][F][F]": 27914068,
    "[F][C]": 4295098,
    "[N][C][=Branch1][C]": 47247706,
    "[=C][NH1]": 8592292,
    "[C][=C][Ring2][Ring1][=C]": 4297336,
    "[C][=C][C][=C][C][=C][Ring1][=Branch2]": 12894528,
    "[=N][C][=Ring1]": 8598092,
    "[C][Branch1][C][N]": 12899376,
    "[C][O][C][=C][C][=C][Branch2][Ring2]": 15053619,
    "[C][=N][C][=C][Branch1]": 23658415,
    "[=C][/C][=C]": 2151216,
    "[C][O][C][=C][C][=N]": 10758500,
    "[Branch1][=Branch2][C][=C][C][=C][C][=C][Ring1][=Branch1]": 6455187,
    "[C][=C][C][=Branch2]": 8608832,
    "[Branch2][C][=Branch1][C][=O]": 6458199,
    "[C][Branch2][Ring1][O]": 2152914,
    "[C][C][C][N]": 2153006,
    "[C][C][C][=N]": 47377066,
    "[Branch1][C][O][C][=C][C][=C]": 23688907,
    "[C][Branch2][Ring1][=Branch2]": 15078385,
    "[=C][Ring2][Ring1][Branch1]": 12924762,
    "[O][C][C@@H1]": 15081948,
    "[C][=C][C][=C][Branch2][Ring1][Branch2]": 6464331,
    "[N][C][=Branch1][C][=O][/C]": 4310618,
    "[=Branch2][C][Branch1][C][F][Branch1][C][F][F][=C][Ring1][#Branch2]": 30189754,
    "[C][Ring1][=Branch1]": 8627076,
    "[=N][C][C]": 43135800,
    "[Branch1][=Branch1]": 4314078,
    "[N][C][C][Ring1][=Branch1]": 8628464,
    "[C][C][=N][NH1]": 6471444,
    "[/N][=C]": 2157382,
    "[C][=C][C][Branch1][Ring1][O]": 19419723,
    "[C][Ring1][Branch1][=C][Ring1][=Branch2]": 15104838,
    "[C][C][C][N][Branch1]": 36691576,
    "[C][C][=C][C]": 2158398,
    "[=Ring1][#Branch2]": 6476958,
    "[C][=C][C][=C][C][Branch1][C]": 8636912,
    "[N][O][C][C]": 6479190,
    "[C][C][C][Ring1][Branch1][C]": 2160063,
    "[C][C][C][=Branch1][C][=O]": 21605230,
    "[N][=C][Ring2][Ring1][Ring1]": 6482523,
    "[NH1][C][=C][C][Ring1][=Branch2]": 25942032,
    "[=C][N][C][=C][C][=C]": 25943256,
    "[C][=C][C][Branch1][C][O][=C]": 8648972,
    "[N][C][=C][C][=C][Branch1][=C]": 12973890,
    "[Ring1][O][C][C]": 25949400,
    "[Branch2][Ring1][=N]": 12976470,
    "[=C][S]": 6488571,
    "[S][Ring1][Branch1]": 60561900,
    "[O][C][=C][C][Branch1]": 21633710,
    "[N][C][=C][Branch1][=Branch1][C][Branch1][C][N][=O]": 6493014,
    "[/C][=Branch2]": 8659668,
    "[O][C][=C][C][=C][Branch1]": 12990876,
    "[C][=N][C][NH1]": 67126067,
    "[=C][/C]": 21653950,
    "[C][=C][C][Branch2][Ring1][Ring1]": 6496605,
    "[C][=C][N][=C][Branch1]": 28155426,
    "[O][C][=C][C]": 12995988,
    "[#C][C][=Branch1][C][=O]": 4332962,
    "[P][N][C][=Branch1][C][=O]": 47670436,
    "[C][=C][C][Branch1][C][F][=C]": 6501096,
    "[P][C][=Branch1][C][=O]": 19504224,
    "[C][=C][C][=C][Ring1][=N]": 2167294,
    "[N][Ring1][Branch1]": 10838225,
    "[=C][C][=C][C][=C]": 13007202,
    "[C][Branch2][Ring1][Branch2]": 2168256,
    "[O][C][C][=N]": 8675404,
    "[O][O][C][C]": 39049542,
    "[N][Ring1][S]": 19525914,
    "[N][C][=N][C][=C][C][=C]": 19526175,
    "[N][=C][Ring2][Ring1][=Branch1]": 34722944,
    "[Ring1][=Branch1][=C][Ring2][Ring1]": 10852140,
    "[P][C][C]": 19535355,
    "[N][Branch1][C][C][C][C][Ring1][#Branch1]": 21708560,
    "[C][=C][C][=C][NH1]": 15196188,
    "[=Branch1][N+1]": 4342898,
    "[C][C][Ring1][Branch2]": 8686260,
    "[=C][N][C][=Branch1][C][=O]": 2171934,
    "[=C][Ring2][Ring1][O]": 2172371,
    "[=N][C][=C][C][=C]": 21724320,
    "[C@H1][Branch1][C]": 15207311,
    "[Branch2][Ring1][S]": 28243670,
    "[N][N][C][C][N][Branch1][C][C][C][C][Ring1][#Branch1]": 21734190,
    "[N][=C][Branch1][=Branch2]": 8695568,
    "[N][C][=N][C][=C][Branch1][C][Cl]": 10871615,
    "[C][Ring1][#Branch1]": 2174338,
    "[=N][N][C][=Branch1][C][=O]": 6523584,
    "[C][=C][Branch1][=C]": 10872765,
    "[NH1][C][=C][C][Ring1][Branch1]": 28275390,
    "[Branch1][C][Br][C][=C][Ring1][#Branch1]": 10876095,
    "[C][=C][Branch1][#Branch2]": 13051746,
    "[C][Branch1][Branch2]": 21756210,
    "[Branch2][C][=C][C][=C]": 13055358,
    "[Branch2][Ring1][N]": 10880110,
    "[C][C][Ring1][=N]": 17408216,
    "[Branch1][Ring1][C]": 4352624,
    "[Branch1][C][F][=C][Ring1][#Branch1]": 2176470,
    "[N][C][C][O][C][C][Ring1][=Branch1][C]": 17416320,
    "[Ring2][Ring1][C][C]": 2177163,
    "[C][Ring2][Ring1][#Branch1]": 6531981,
    "[N][Branch1][Branch2][C][C]": 34838368,
    "[C][=C][Ring2][Ring1][N]": 32667885,
    "[S][Ring1][=Branch2]": 15245825,
    "[O][C@H1]": 45742641,
    "[N][S][=Branch1][C][=O][=Branch1][C][=O]": 6535380,
    "[C][=N][N][Branch1]": 23965634,
    "[NH1][C][=Branch1][C][=O]": 4357562,
    "[Ring1][C][#N][C][=N]": 4357680,
    "[C][=C][C][Branch1][S]": 6537792,
    "[#C][N][C][=C][C][=C]": 6538368,
    "[C][=C][C][=C][Branch1][S]": 6540036,
    "[C][=N][C][=C][C][=C]": 2180206,
    "[C][Ring1][=N]": 4360578,
    "[C][=C][C][=C][C][=C][Ring1][=Branch1][S]": 4360624,
    "[C][Branch1][=Branch2][C][Branch1][C][F][Branch1][C][F][F]": 4360650,
    "[S][C][=Branch1][C][=O]": 4361072,
    "[=N][Ring2][Ring1][#Branch2]": 4361472,
    "[O][C@@H1]": 6543087,
    "[#C][C][C]": 32719440,
    "[#Branch2][C][C]": 8725452,
    "[C][Branch1][C][N][=O]": 21819700,
    "[C][=C][C][=C][Branch2][Ring1][#Branch2]": 6546006,
    "[=C][C][=C][N][=C]": 2182469,
    "[N][=C][N][=C][Ring1][#C]": 13096200,
    "[=C][Ring2][Ring1][C]": 39296790,
    "[C][=C][C][=Branch1][C][=O]": 28383485,
    "[N][C][C@H1]": 2183368,
    "[N][C][=N][NH1]": 13103214,
    "[C][C][N][C][C]": 2184058,
    "[C][=C][C][=C][C][Branch1][C][F][=C][Ring1][#Branch1]": 13105476,
    "[C][=C][C][=C][Branch1][=C]": 2184254,
    "[=C][Ring1][=C]": 41509889,
    "[N][Branch1][Ring1]": 30588334,
    "[N][C][=Branch1][C][=O][C][=C][N][=C]": 32777760,
    "[=Ring1][=Branch1]": 2185411,
    "[=C][N][=C]": 6557142,
    "[=N][Ring2][Ring1][#Branch1]": 10929820,
    "[N][C][=Branch1][C][=O][N][C]": 8744220,
    "[=C][Ring1][=N]": 4372620,
    "[C][=C][C][Branch1][P]": 17492792,
    "[O][O][C]": 8747028,
    "[C][Branch2][Ring1][#Branch2]": 2186923,
    "[Ring1][=Branch1][N]": 10935235,
    "[C][C][Ring1][=Branch1]": 2187366,
    "[C][Branch2][Ring1][=Branch1]": 10938960,
    "[C][Branch1][C][N][=C]": 2188104,
    "[N][C][=C][C][=C][Branch1][P]": 10941310,
    "[C][=C][C][=C][Branch1][C][O][C][=C][Ring1][#Branch1]": 15321341,
    "[N][N][=C][Branch1]": 4378792,
    "[C][=C][C][=C][Branch1][C][Cl][C][=C][Ring1][#Branch1]": 21895790,
    "[Ring1][=Branch1][=N][Ring2][Ring1]": 24085413,
    "[C][=C][N][=C][C][Branch2][Ring1]": 28464683,
    "[N][C][C][C][N]": 6568866,
    "[O][C][=C][Ring1]": 26277372,
    "[C][=N][C][Branch1][C]": 2189906,
    "[C][Branch1][=N][C][=C]": 41611273,
    "[N][C][=C][C][=C][Branch1][S]": 28475694,
    "[Branch2][Branch1][Ring2]": 2191038,
    "[C][Ring1][#Branch2]": 17529544,
    "[N][=C][Ring1][P]": 24104938,
    "[C][=C][C][=C][C][=C][Ring1][=Branch1][=C]": 10957180,
    "[C][Branch1][=Branch2][C][=C][C][=N][C][=C][Ring1][=Branch1]": 8767176,
    "[C][Branch1][N]": 10959405,
    "[C][=Branch1][Ring2]": 21922650,
    "[C][O][C][=C][C][Branch1]": 2192599,
    "[NH1][Ring1]": 8770412,
    "[=C][N]": 15348508,
    "[C][O][C][=C][C][Branch2][Ring1]": 43862660,
    "[C][Branch2][Ring1][#Branch1]": 37283941,
    "[N][C][=C][C][=C][C][=Branch1][Ring2][=C][Ring1][=Branch1]": 6581760,
    "[Branch1][C][N][C][C]": 15360359,
    "[=N][O]": 26332656,
    "[=Branch2][C][=C][C][=C][C][=C][Ring1][=Branch1][C]": 2194488,
    "[C][=C][C][=C][Branch2][Ring1][=Branch2]": 2194881,
    "[C][=Branch1][C][=O][O][C]": 17562144,
    "[NH1][Ring1][=Branch2]": 52690224,
    "[C][=C][Ring2][Ring1][C]": 59277366,
    "[C][Branch1][C][F][=C][Ring1][#Branch1]": 4392080,
    "[N][=Ring2][Ring1]": 41734830,
    "[=C][C][=C][NH1]": 6589947,
    "[N][Branch1][#Branch2]": 4393918,
    "[=C][Ring2][Ring1][#C]": 21974790,
    "[Branch2][Ring2][P]": 8790460,
    "[Ring1][O][C][=C][Ring2][Ring1]": 32967915,
    "[C][Branch1][=Branch2][C][=C][C][=C][C][=C][Ring1][=Branch1]": 21981550,
    "[C][C][C][O]": 8792700,
    "[N][C@H1][C][C][C@H1]": 19787391,
    "[C][Branch1][C][F][=C][Ring1][Branch2]": 15393546,
    "[Branch2][Branch1][=Branch1]": 24191772,
    "[N][=C][Ring1][#Branch2]": 13197684,
    "[C][N][Branch1]": 21998560,
    "[C][=C][C][=C][C][=C][Ring1][#Branch2]": 28601040,
    "[C][=C][C][=C][C][=C][Ring1][=Branch1][N][Ring2][Ring1]": 15402135,
    "[N][C][=Branch1][C][=O][C][=C][C][=C][Branch1][C][F]": 8801760,
    "[C][=C][C][=C][Branch1][P]": 50614076,
    "[Branch1][C][=N]": 22007040,
    "[N][C][=N][C][=C][Branch2][Ring1]": 8803884,
    "[N][=C][Ring1][#C]": 30818410,
    "[N][C][C][C][C@@H1]": 4402820,
    "[C][=C][C][=N][C][NH1]": 30823940,
    "[N][C][C][C][Ring1][Ring1]": 2201832,
    "[=N][Ring2][Ring1][=Branch2]": 33028080,
    "[=Branch1][C][C][C][Ring1][Ring1]": 11010075,
    "[=O][C]": 26427072,
    ".[Cl]": 30837184,
    "[=N][C][=C][Branch1][C][Cl]": 39651228,
    "[S][N][C][=C][C][=C]": 19827405,
    "[=O][=C]": 8812636,
    "[Ring2][Ring2][C][C]": 17626848,
    "[C][=N][C][NH1][C][=C][C]": 2203372,
    "[C][=C][Branch2][Ring1][Ring1]": 4406904,
    "[C][C][C][C][C][C]": 8814960,
    "[C][=C][C][=C][Branch1][C][Cl]": 13223484,
    "[C][O][C][=C][C][=C][Branch1]": 11019745,
    "[Ring2][Ring2][=Branch1]": 46288494,
    "[Branch2][Branch1][Ring1]": 28655562,
    "[S][C][Ring2][Ring1]": 46292736,
    "[#C][C][=C][N][=C]": 6613899,
    "[=Ring1][O]": 37480988,
    "[N][Ring1][P]": 4410204,
    "[Branch2][Ring2][S]": 4410642,
    "[C][Branch1][C][Br][=C][Ring1][#Branch1]": 15441440,
    "[=Branch2][C][=C][C][=C][C][=C][Ring1][=Branch1]": 4411840,
    "[NH1][C][Ring1]": 8823948,
    "[C][=C][Ring2][Ring1][S]": 4412828,
    "[O][C][=C][C][=C][Ring1][#Branch1]": 35306304,
    "[C][Branch1][C][C][Branch1][C][C][C]": 4414540,
    "[C][=C][Branch1][#C]": 11036655,
    "[C][=C][Branch2][Ring1][Ring2]": 8831060,
    "[N][=N][Ring2][Ring1]": 13247982,
    "[O][=C][N][C][=Branch1][C][=O]": 24292554,
    "[Branch1][N][C][=Branch1][C][=O]": 30919042,
    "[N][C][C][C][N][C][C]": 4417954,
    "[N][C][=C][C][=C][Branch1][C][Cl][C][=C][Ring1][#Branch1]": 8837344,
    "[C@H1][C][C@@H1]": 13258602,
    "[C][=C][N][C]": 6629745,
    "[C][Ring2][Ring1][=Branch1]": 4419982,
    "[C][C][O][C]": 11051210,
    "[Branch1][C][C][=Branch1][C][=O]": 2210354,
    "[#Branch1][C][=Branch1][C][=O]": 35366464,
    "[C@H1][Branch2][Ring2]": 26527188,
    "[=N][Ring2][Ring2]": 8843496,
    "[O][C][Branch1][C][F][Branch1][C][F][F]": 11055025,
    "[C][C][Ring1][#Branch2]": 30957458,
    "[C][C][Branch1]": 4422612,
    "[Branch1][C][F][C][=C][C][=C][Ring1][#Branch1][F]": 6635547,
    "[Branch2][Ring1][C]": 4423906,
    "[=Branch2][Ring1]": 35392592,
    "[Ring2][Ring1][N]": 15484910,
    "[N][C][=C][Branch2][Ring1]": 2212192,
    "[Branch2][Ring2][C]": 6636840,
    "[S][C][C]": 11062000,
    "[C][=C][C][=N][C][=N]": 17701528,
    "[C][=C][C][=Branch1][C][=O][N][C][=C][C][=C]": 39833532,
    "[C][Branch1][C][N][C][C]": 24344364,
    "[Branch2][Ring2][=C]": 4426628,
    "[C][=C][Branch1][C][O]": 13280718,
    "[N][=C][C][Ring1]": 66405990,
    "[=Branch2][C][C]": 13282002,
    "[N][C][=C][C][=C][Branch1][C][Cl]": 11068535,
    "[C][=C][Ring2][Ring1][=Branch1][C]": 11069905,
    "[C][=N][N][=C]": 19927809,
    "[C][O][C][=C][C][Branch2][Ring2]": 4429044,
    "[C][C][Ring2][Ring1][#C]": 19931346,
    "[Ring2][Ring1][=Branch1][C]": 22147510,
    "[C][=C][C][=C][Branch1][=Branch2][C][Branch1][C][F][Branch1][C][F][F]": 19937448,
    "[S][N][C][=C][C][=C][Branch1][C][F]": 55385125,
    "[Ring1][#C][=O]": 11079115,
    "[Branch1][C][O][C][Branch1][C][Cl]": 6648861,
    "[C][=C][Ring2][Ring1][P]": 15516473,
    "[Ring1][Branch1][C][C]": 6649971,
    "[NH1][N][=Ring1]": 2217154,
    "[O][C][C][=Branch1][C][=O]": 11087085,
    "[N][C][=N][C][=N][C][=C][Ring1][=Branch1][C]": 62100752,
    "[C][=C][C][=C][Branch1][#C]": 26615676,
    "[=C][Ring2][Ring1][=C]": 4436640,
    "[=C][Ring2][Ring1][=N]": 31061422,
    "[=N][Ring2][Ring1][=Branch1]": 31066140,
    "[O][N][=C]": 22191610,
    "[C][C][O][C][=Branch1][C][=O]": 19974051,
    "[C][=C][C][=C][Branch1][=Branch1]": 8877668,
    "[O][Ring1][Branch1]": 2219550,
    "[O][C][C@H1]": 15537788,
    "[C@@H1][C][C@H1]": 13319592,
    "[C][Ring2][Ring1][Branch2]": 2220235,
    "[C][=Ring2]": 2220486,
    "[C][=C][C][Ring1][=Branch2]": 15544767,
    "[C][=Branch1][C][=O][N]": 13324638,
    "[O][C][=C][C][=C][C][=C][Ring1][=Branch1][C]": 17766960,
    "[Branch2][Ring1][Branch1][C]": 11105550,
    "[N][S]": 6663600,
    "[Ring1][N][C]": 2221486,
    "[C][=C][C][Branch2][Ring1][Branch2]": 4442976,
    "[NH1][C][=C][Branch1]": 44433880,
    "[N][=C][Ring1][Branch1]": 24439921,
    "[=N][Ring2][Ring1][Branch2]": 11110255,
    "[Ring1][=Branch1][=O]": 4444560,
    "[O][=C][NH1]": 40002858,
    "[O][C][=Ring1]": 6667326,
    "[S][Branch1][C][N]": 35561232,
    "[Ring1][C][C][C][C]": 2222694,
    "[C][=C][C][Branch2][Ring1][Ring2]": 8891876,
    "[C][Branch1][Ring1][C][#N]": 4446250,
    "[N][Ring1][#C]": 108937388,
    "[C][=N][C][=C][C][=C][C][=C][Ring1][=Branch1]": 22234500,
    "[O][C][=C][C][Branch2][Ring1]": 37801829,
    "[C][=C][Branch1][Branch2]": 28909998,
    "[=O][C][C]": 8895960,
    "[Branch2][C][C][=N][NH1][C][=Ring1]": 60049944,
    "[N][=C][Ring2][Ring1][#Branch1]": 4448828,
    "[=N][N][Branch1]": 13347504,
    "[C][Branch1][#Branch1]": 11123570,
    "[S][C][Branch1]": 33372150,
    "[Ring1][C][C]": 8899320,
    "[F][C][=C][N][=C]": 2225183,
    "[C][=C][C][Branch1][C][Cl][=C]": 13351272,
    "[N][C][=N][C][=C][C][=C][C][=C][Ring1][=Branch1]": 22256170,
    "[=C][Ring2][Ring1][P]": 15582154,
    "[C][Branch1][C][O][=C][Ring1][#Branch1]": 42295330,
    "[Branch2][Branch1][#Branch1]": 8905904,
    "[N][C][C][C][C][C][C]": 4453168,
    "[C][Branch1][=Branch2][N][C][C][O][C][C]": 26723328,
    "[Br][=C]": 22270980,
    "[C][Branch1][C][C][=C][Ring1][#Branch1]": 2227177,
    "[C][C][N][C][=Branch1][C][=O]": 4454870,
    "[Ring1][Branch1][=C]": 26729556,
    "[N][C][=N][C][=N][C][=C][Branch1][=Branch1][C][Branch1][C][N][=O]": 6683400,
    "[S][C][=C][C]": 6684081,
    "[C][=C][Branch1][P]": 11140170,
    "[=C][C][Branch1][Ring1][O]": 28968849,
    "[=Ring1][#C]": 20056374,
    "[C][C][=C][C][=C][C][=C][Ring1][=Branch1][C]": 22286160,
    "[N][C][=C][C][Branch1][=Branch2]": 4457604,
    "[N][C][=C][C][=C][C][=C][Ring1][=Branch1][C]": 4457788,
    "[=Ring1][P]": 13375380,
    "[C][C][=N][N][Branch1]": 22293540,
    "[=C][Ring2][Ring1][O][C]": 20066751,
    "[Ring1][=C][=N][Ring2][Ring1]": 17837944,
    "[N][C][=N][C][=C][C][=C][Branch1]": 4459550,
    "[Branch2][=Branch1]": 104818225,
    "[Ring1][C][O][C]": 20072214,
    "[N][Branch1][C][C][C][C][C]": 11151680,
    "[C][=C][Branch1][C][N][N][=C][N][=C][Ring1][#Branch1]": 17848096,
    "[N][C][=C][C][=C][Branch1][C][F][C][Branch1][C][Cl][=C][Ring1][Branch2]": 37933970,
    "[P][N]": 31240160,
    "[C][=C][Branch1][Ring1][C][#N]": 37938866,
    "[Ring1][Branch1][=N]": 4463612,
    "[#Branch2][C][C][=C][C][=C][C][=C][Ring1][=Branch1]": 24554112,
    "[Branch2][Ring2][O]": 8928788,
    "[=Ring2][Ring1][Branch2]": 29019861,
    "[N][=C][Ring2][Ring1][Branch1]": 29020342,
    "[=C][C][=N][C][=N][C]": 4464720,
    "[=N][Ring1][=C]": 11163495,
    "[C][O][C]": 2232804,
    "[=C][C][=N][Ring2][Ring1]": 24561284,
    "[C][=C][Branch1][S]": 40191822,
    "[N][C][C][C][C@H1]": 58058312,
    "[N][C][=N][C][=N][C][=C][N][=C]": 13399764,
    "[O][N][C][C]": 8933588,
    "[=Branch1][=C]": 8934312,
    "[O][C][C][Ring1][#Branch1]": 20103111,
    "[N][C][=N][C][=N][C]": 46910367,
    "[N][N][C]": 4468080,
    "[C][=C][C][=C][Branch2][Ring1][#Branch1]": 13404348,
    "[#Branch1][C][C][C][C]": 6703179,
    "[N][C][=C][C][=C][C][=Branch1][Ring2]": 2234714,
    "[=N][Ring2][Ring1][Branch1]": 62580224,
    "[C][=Branch1][C][=O][N][Ring2][Ring1]": 2235053,
    "[C][Ring2][Ring1][Ring1]": 31295614,
    "[=C][Ring2][Ring1][=Branch1][C]": 17885504,
    "[=Branch2][N][C][=Branch1][C][=O]": 4471646,
    "[C][C][C][Branch1]": 2236038,
    "[N][=C][Ring2][Ring1][=Branch2]": 24596682,
    "[C][C][C][C][C][C][C][C]": 42489567,
    "[C][=C][Ring2][Ring1][Ring1][O][C][C]": 2236581,
    "[C][O][=C]": 15656368,
    "[C][C][C][Ring1][=Branch1]": 22368150,
    "[S][N]": 20131848,
    "[C][N][Branch1][C][C][C][C]": 2236950,
    "[N][C][C][N][Branch2][Ring1]": 2237187,
    "[N][C][C][=C][Branch1]": 22373170,
    "[=N][N][Branch1][C][C]": 22374430,
    "[N][C][=C][N][=C][C][=C][Ring1][=Branch1]": 15663725,
    "[S][C][=C][C][=C][Branch1]": 2237691,
    "[C][=N][C][=N][C][Branch1][C]": 20142558,
    "[C][Ring2][Ring1][Branch1]": 55959025,
    "[C][=C][C][Branch1][=N]": 26864568,
    "[O][N][C][=N]": 4477676,
    "[=Branch2][C][=Branch1][C][=O]": 4477972,
    "[O][C][=C][C][=C][C][Branch2][Ring1]": 17912968,
    "[C][=C][C][=C][C][Branch1][S]": 20153340,
    "[C][S][=Branch1][C][=O][=Branch1][C][=O]": 26872740,
    "[C][=C][C][Branch1][C][O][=C][Branch2][Ring1]": 40314582,
    "[C][Ring2][Ring1][Ring2]": 2239901,
    "[Branch2][Ring1][Ring2][N][C][=C][C][=C][Branch1][=Branch2]": 6720756,
    "[Ring1][N][C][C]": 11202250,
    "[O][C][C][C][C]": 6721578,
    "[C][Ring1][=C][=C][Ring2][Ring1]": 2240813,
    "[N][Ring1][Branch1][C][C]": 4482322,
    "[#C][C][=N]": 6723927,
    "[Branch1][N][C][=C][C][=C]": 22413730,
    "[C][=C][C][=C][C][=C][Ring1][=Branch1][F]": 8966904,
    "[C@H1][C][C][C]": 31384864,
    "[Ring1][#Branch1][=N][Ring2][Ring1]": 11209590,
    "[NH1][N][=C][Branch1]": 8968032,
    "[C][N][Branch1][C][C][C]": 17939240,
    "[N][C][=C][C][=C][Branch1][#Branch2]": 8970384,
    "[Branch1][N][C]": 17941360,
    "[O][C][=C][N][=C]": 29155685,
    "[C@H1][Branch2][Ring1]": 8971012,
    "[C@@H1][Branch2][Ring2]": 24671526,
    "[Ring2][Ring1][N][C]": 38131153,
    "[N][=C][Branch1][S]": 4486342,
    "[O][O][=C]": 6729711,
    "[N][C][C][=C][C][=C][C][=C][Ring1][=Branch1]": 20190015,
    "[NH1][Ring1][Branch1]": 8973608,
    "[C][Branch2][Ring1][Ring2][N][C][=C][C][=C][Branch1][=Branch2]": 6730704,
    "[C][=C][C][Branch1][#C]": 24679556,
    "[C][=C][N][=C][N][=C][Ring1][=Branch1]": 8975332,
    "[O][=C][Branch2][Branch1]": 20195298,
    "[C][Branch1][C][N][=N]": 4488230,
    "[N][Ring2][Ring1][Ring1]": 4488938,
    "[C][O][C][=C][C]": 29179189,
    "[O][=C][Branch2][Ring2]": 8978640,
    "[C][Branch1][C][Cl][=C][Ring1][S]": 6734400,
    "[N][=C][NH1]": 4489802,
    "[N][=C][Branch1][=N][N][C][=C][C][=C]": 67359990,
    "[#Branch2][C][=C][C][=C][C][=C][Ring1][=Branch1]": 51644338,
    "[N][C][C][C][C][C][Ring1][=Branch1]": 6737415,
    "[N][Branch1][C][C][C][=Ring1][=Branch1]": 103322578,
    "[=Branch1][Ring2][=N][Ring1][=Branch1]": 6738810,
    "[C][Branch1][C][C][C]": 33695220,
    "[F][=C][Ring2][Ring1]": 22465060,
    "[C][Branch1][=Branch1]": 38192183,
    "[C][=Ring1][=Branch1]": 13480014,
    "[N][=N][Ring1]": 33702615,
    "[S][Ring1][=N]": 6741414,
    "[N][Ring1][#Branch1]": 22473580,
    "[N][C][=C][C][=C][N][=C]": 42700790,
    "[C][N][N][=C]": 31466932,
    "[C][C][C][Ring1][Branch1]": 26973228,
    "[N][C][=C][C][=C][Branch1][#C]": 20230506,
    "[C][=Branch1][C][=O][NH1]": 13488372,
    "[N][C][C][C][Branch2][Ring1]": 40465422,
    "[N][C][C][=N]": 20233998,
    "[Branch1][C][O-1]": 4496980,
    "[O][C][C][=C][C][=C][C][=C][Ring1][=Branch1]": 11243405,
    "[C][=C][C][=C][Ring1][=N][Ring1][=Branch2]": 33738240,
    "[Branch2][Ring1][Ring2][C][=C][C][=C][Branch1][#Branch2]": 6749082,
    "[Branch2][Ring2][=N]": 22497700,
    "[P][=Branch1][C][=O]": 2249871,
    "[C][=C][C][Branch1][Branch2]": 2249984,
    "[NH1][C][=C][C][=C]": 11250200,
    "[N][C][=C][C][=C][Branch1][C][Br]": 6750729,
    "[C][N][Branch1][C][C][C][C][Ring1][#Branch1]": 2250504,
    "[=N][Ring1][=N]": 6752169,
    "[=N][N][C][=N]": 24760186,
    "[Branch1][C][=Branch1][C][=O][C][=C][Branch1][C]": 4502400,
    "[N][O]": 29268122,
    "[=C][C][=C][Ring2][Ring1][Ring1]": 20265579,
    "[=Branch2][Ring1][=Branch1]": 11258770,
    "[S][C][=C][C][=C]": 18014656,
    "[C][Branch1][C][C][Branch1][C][C][O]": 13511892,
    "[C][=C][C][Branch1][=C]": 15765008,
    "[S][=Branch1][C][=O][=Branch1][C][=O][N][C][C]": 47299308,
    "[Cl][C]": 72077728,
    "[N][Branch1][#Branch1]": 11262565,
    "[=N][NH1][C][=Ring1]": 2252736,
    "[=C][C][=C][Ring1][#C]": 6758694,
    "[N][C][=Branch1][C][=O][C][=C][C][=C][C][=C][Ring1][=Branch1]": 2253125,
    "[C][Branch2][Ring1][#C]": 4506722,
    "[C][=C][C][Ring1][=Branch1][=C][Ring1][#Branch2]": 6761172,
    "[C][Ring1][O]": 11269605,
    "[Ring1][O][=C]": 13524942,
    "[C][=C][N][=C][Branch1][C][N][C]": 9017920,
    "[Branch1][C][I]": 4509176,
    "[=N][C][=Ring2]": 56370250,
    "[=Ring1][Branch2]": 24804846,
    "[C][=C][N][=C][NH1]": 24804989,
    "[=N][N][C]": 31571512,
    "[C][=C][C][Branch1][C][F][=C][C][=C][Ring1][#Branch1]": 2255157,
    "[C][=N][N]": 11276115,
    "[C][Branch1][=N][N][C][=C][C][=C]": 9021652,
    "[C][=N][Ring2][Ring1][Ring2]": 6766596,
    "[N][C][=Branch1][C][=O][C@@H1]": 4511350,
    "[Ring1][C][=C][C][=C][Branch1][=Branch2]": 47372745,
    "[N][C][=Branch1][C][=O][C][C]": 45117940,
    "[Branch2][Branch1][Branch2]": 18048600,
    "[C][Branch2][Ring1][N]": 18049000,
    "[=N][S]": 15792931,
    "[O][C][Branch1][C][F][F]": 22563340,
    "[N][Ring1][Branch2]": 13539174,
    "[=Branch1][N+1][=Branch1][C][=O][O-1]": 6771600,
    "[C@@][Branch1][C][C]": 63205968,
    "[C][=C][C][Branch1][#Branch2]": 9029564,
    "[N][C][=C][C][=C][Branch1][C][O][C][=C][Ring1][#Branch1]": 9029900,
    "[N][Branch1][S][C]": 9030476,
    "[P][C][=C][C][=C]": 4515482,
    "[Branch2][Ring2][#C]": 22577730,
    "[N][C][=C][Ring2][Ring1]": 4515576,
    "[C][=C][C][=C][Branch2][Ring1][C]": 9032040,
    "[=Branch1][C][Branch1][C][N][=O][=C]": 2258059,
    "[Ring1][=Branch1][C][=Branch1][C][=O][N][C]": 18065088,
    "[N][C][C][N][Branch2]": 24841058,
    "[N][Branch1][=Branch1][C][Branch1][C][C]": 4516684,
    "[/C][=C][\\C][=Branch1][C][=O][N][C][=C][C][=C]": 13552740,
    "[C][=N][C][=C][N][=C]": 22590070,
    "[Branch1][Ring1][O][C]": 20331315,
    "[C][=C][C][Branch1][N]": 27110268,
    "[C][=Branch1][C][=O][N][Branch1][C][C]": 42926833,
    "[Branch1][C][O][C][C][Ring1][#Branch1]": 27113808,
    "[N][=C][N][Ring1]": 6778926,
    "[C][=C][C][=C][C][Ring1][=Branch1][=C][Ring1][#Branch2]": 31638992,
    "[N][Branch1][Branch2][C][C][C][C][C][Ring1][Branch1][C]": 49729944,
    "[N][C][=C][Branch1][C][Cl]": 94939866,
    "[C][=C][C][=Branch1]": 11303680,
    "[C][=C][C][=C][C][=C][Branch1]": 13564572,
    "[C][C][Ring2][Ring1][S]": 6782529,
    "[=Ring2][Ring1][#Branch2]": 4521972,
    "[C][=Branch1][C][=O][N][C][Ring1][S]": 2261076,
    "[Branch2][Branch1][C]": 13567482,
    "[N][=C][Branch1][#Branch2]": 13567956,
    "[C][=C][N][=C][C][=C][C][Branch2][Ring1]": 4522676,
    "[C][=C][C][=C][C][=N][C][=C][Ring1][=Branch1]": 6784956,
    "[Branch1][C][C][C][=C][Ring1][#Branch1]": 4523538,
    "[=N][C][N][C][C][N][Branch1][C][C][C][C][Ring1][#Branch1]": 13571334,
    "[=N][C][Ring2][Ring1]": 4523828,
    "[C][=C][C][=N][C][Branch1][#Branch2]": 27147096,
    "[C][C][C][C][C@@H1]": 20362761,
    "[C][=C][Branch1][=Branch1]": 9050268,
    "[C][=C][C][=C][C][Branch1][=Branch2][C][Branch1][C][F][Branch1][C][F][F][=C][Ring1][#Branch2]": 2262768,
    "[Ring1][N][=C]": 58832982,
    "[C][=C][C][=C][Branch2][Ring1][P]": 9051564,
    "[#C][C][O]": 20366406,
    "[Branch2][C][C][C]": 9051828,
    "[=Branch1][C][=Branch1][C][=O][O]": 24893946,
    "[=Branch2][C][Branch1][C][F][Branch1][C][F][F][=C]": 24897048,
    "[C][=Branch1][C][=O][C][=Ring1]": 13580664,
    "[C][C][C][C@H1]": 18109344,
    "[C][=C][C][NH1][C][=C][C]": 9055924,
    "[C][=C][C][Branch2][Branch1]": 11320245,
    "[C][C][=N][C][=N]": 2264204,
    "[=C][C][=C][Ring1][S]": 24909456,
    "[=N][Ring2][Ring1][=Branch1][C]": 56613400,
    "[C][=C][Ring2][Ring1][O][C]": 6793656,
    "[C][C][=C][C][=C][Branch2][Ring1]": 2264571,
    "[N][C][=Branch1][C][=O][C][C][=N]": 15853341,
    "[=Ring1][S]": 11324185,
    "[C][=C][C][Branch1][C][Br]": 61155972,
    "[O][C][#C]": 20385549,
    "[C][N][Branch1][C][C][C][C][C]": 9060548,
    "[C@@H1][C][C][C]": 15856022,
    "[C][C][Ring1][S]": 9061644,
    "[C][O][C][=C][C][=C][C][=C][Ring1][=Branch1]": 43045127,
    "[N][=C][N][Branch1][C][C][C][=Branch1][C][=O]": 4531626,
    "[O][N][C][=C][C][=C][C][=C][Ring1][=Branch1]": 18128080,
    "[C][O][C][=N]": 2266112,
    "[Branch1][N][C][C]": 29460392,
    "[Branch1][C][O][=C][Ring2][Ring1][Ring2]": 6799485,
    "[O][N][C][=Branch1][C][=O][C][C][C][Ring1][Ring1]": 9067296,
    "[N][=C][Ring2][Ring1][Ring2]": 63475272,
    "[Branch1][Ring1][C][#N]": 2267142,
    "[C][N][Branch1][C][C][C][=Branch1][C][=O]": 9068772,
    "[NH1][C][=C][C][Ring1][Branch1][=C][Ring1][=Branch2]": 27210540,
    "[=C][C][=C][C]": 18140768,
    "[C][C][C][N][C][=Branch1][C][=O]": 9070492,
    "[C][=C][C][=C][Branch1][#Branch1]": 9071588,
    "[C][=C][C][=N][C][=C][Ring1][=Branch1][N][C][=Branch1][C][=O]": 4536404,
    "[=C][Ring2][Ring1][S]": 27218724,
    "[Ring1][=Branch1][C][=Ring1]": 27220872,
    "[=C][Branch1][=Branch2]": 2268557,
    "[C][Ring1][#C][=C][Ring2][Ring1][Ring1]": 4537808,
    "[N][=C][Ring1][=Branch1][C]": 4537826,
    "[C][=C][C][=C][Ring1][=Branch1][C]": 93030312,
    "[NH1][N][=C][C][Ring1][Branch1][=C][Ring1][=Branch2]": 4538888,
    "[C][=C][Branch1][Ring1][O][C]": 29506516,
    "[C][=C][C][=C][N][Ring1][=Branch2]": 2270154,
    "[C][=C][C][=C][C][=Branch1][Ring2][=C][Ring1][=Branch1][O][C][O]": 22705200,
    "[C][=C][C][=C][Branch1][N]": 18164344,
    "[C][N][C][=C]": 18165960,
    "[C][=C][Ring1][#Branch1][Cl]": 34062150,
    "[Branch1][C][Cl][C][=C][C][=C][Ring1][#Branch1][Cl]": 9083868,
    "[C][Ring1][Branch2]": 11355300,
    "[N][C][C][N][C][C][Ring1][=Branch1]": 11356820,
    "[C][=C][C][Branch2][Ring2][=Branch2]": 9086232,
    "[Branch2][Ring1][=Branch1][N][C][=C][C][=C][Branch1]": 34075470,
    "[#Branch2][N][C][=Branch1][C][=O]": 20445543,
    "[Ring1][N][C][=Branch1][C][=O]": 11359130,
    "[C][=C][C][=C][C][Branch1][#Branch2]": 9087536,
    "[C][C][C][C][Ring1][=Branch1]": 4543788,
    "[C@@H1][Branch1][C][O][C]": 81790344,
    "[Branch1][C][O][C][Branch1][C][O]": 2272032,
    "[N][/N]": 2272097,
    "[Ring2][Ring1][O][C]": 22722560,
    "[Ring2][=C]": 15905848,
    "[N][Ring2][Ring1][=Branch1]": 9089424,
    "[C][Branch2][Ring1][C]": 4544798,
    "[C][C][O][C][=C][C][=N]": 18179880,
    "[C@H1][Branch1][C][N][C]": 13635642,
    "[C][=C][C][=C][Branch1][Branch2]": 34090230,
    "[C][=C][Branch1][=Branch2][C][=C][C][=C][C][=C][Ring1][=Branch1]": 4545900,
    "[Branch2][Branch1][=Branch2]": 38643329,
    "[Ring2][Ring1][Branch1][C]": 40917762,
    "[C][C][=C][C][=C][Branch1]": 20459412,
    "[=Ring2][Ring1][#Branch1]": 34100940,
    "[C][N][C][=C][Branch2][Ring1]": 2273680,
    "[Ring1][=Branch1][C][=C][Ring1][#C]": 13642932,
    "[=C][N][Ring2][Ring1]": 6822129,
    "[C][=Ring1][=Branch2]": 6822543,
    "[=Branch1][N][Branch1][C][C]": 18194424,
    "[C][Branch1][C][C][C][C]": 4549028,
    "[Branch2][C][C][=C]": 6823713,
    "[Ring2][C][Ring1]": 6824070,
    "[C][=C][C][=C][C][=Branch1][Ring2][=C][Ring1][=Branch1][C]": 25024626,
    "[C][=Ring1][#Branch2]": 22751230,
    "[N][C][=Branch1][C][=O][C@H1]": 2275128,
    "[C][=C][C][=N][C]": 15926022,
    "[Branch2][Ring2][#Branch1][C][=C][C][=N][C][=C][Ring1][=Branch1]": 13650906,
    "[Ring1][Branch1][C][O]": 2275266,
    "[C][=C][C][=C][C][Branch1][C][Cl][=C][Ring1][#Branch1]": 9101072,
    "[N][C][=Branch1][C][=O][N][C][=C][C][=C][Branch1]": 9101480,
    "[Ring2][Ring2][#Branch1]": 29582007,
    "[N][C][=C][Branch1][Ring1][C][#N][C][=N]": 11377975,
    "[N][C][=N][C][=C][C][Branch2][Ring2]": 2275683,
    "[C][=N][C][=N][C][NH1][C][=C][C][Ring1][=Branch2]": 31860990,
    "[C][Ring2][Ring1][=C]": 18208656,
    "[C][=C][Ring1][=C][Ring1][#Branch2]": 56903950,
    "[Branch1][P]": 54630288,
    "[C][C][C][Ring1][Ring1][=C]": 9105920,
    "[C][=C][C][=N][C][=C][Ring1][=Branch1][C]": 15935962,
    "[=Branch1][C][O]": 6829731,
    "[=C][C][Branch1][C][F]": 2276652,
    "[C@H1][Branch1][C][O][C]": 27322128,
    "[C][=C][C][=C][Branch2][Ring1][Ring2]": 38708065,
    "[=N][Ring1][=Branch2]": 6830916,
    "[N][Ring1][#Branch2]": 38711006,
    "[N][C][=Branch1][C][=O][C][=C][C][Branch1]": 6831696,
    "[N][C][=C][C][=C][Branch1][=C][O][C]": 6832800,
    "[NH1][C][Ring2][Ring1]": 13665942,
    "[N][=C][C]": 9111132,
    "[C][C][Ring2][Ring1][=Branch1]": 29612115,
    "[N][Ring2][Ring1][#Branch1]": 52395288,
    "[Branch1][C][N][N][=C]": 20502855,
    "[C][=C][C][=C][C][Branch2][Branch1]": 11390525,
    "[C][=N][C][=C][Ring1][=Branch1]": 22781550,
    "[O][C][C][Ring1][=Branch2]": 9112720,
    "[O][C][=C][Branch1]": 6834558,
    "[C][=C][C][=C][C][Branch2][Ring1][=Branch2]": 27339444,
    "[=Branch1][C][=N][N]": 41014242,
    "[S][C][=C]": 20507319,
    "[N][Ring2][Ring1][Branch2]": 6836163,
    "[C][=C][NH1][C][=N]": 11393620,
    "[N][C][=N][C][=C][Branch1][=Branch2][C][Branch1][C][F][Branch1][C][F][F]": 4558106,
    "[C][Branch1][=Branch2][N][C][C][O][C][C][Ring1][=Branch1]": 4558318,
    "[C][O][C][=Branch1][C][=O]": 2279255,
    "[O][C][C][C][N][C][C][N][Branch1][C][C][C][C][Ring1][#Branch1]": 27354840,
    "[C][=C][N][=C][C][Branch1]": 2279607,
    "[C][=C][C][=C][N][N][=C]": 29637907,
