{
    "<s>": 0,
    "<pad>": 1,
    "</s>": 2,
    "<unk>": 3,
    "<mask>": 4,
    "[O]": 5,
    "[C]": 6,
    "[N]": 7,
    "[=N]": 8,
    "[Branch1]": 9,
    "[=C]": 10,
    "[Ring1]": 11,
    "[=Branch1]": 12,
    "[/C]": 13,
    "[\\C]": 14,
    "[Ring2]": 15,
    "[#Branch2]": 16,
    "[Branch2]": 17,
    "[#Branch1]": 18,
    "[=O]": 19,
    "[=Branch2]": 20,
    "[F]": 21,
    "[#C]": 22,
    "[S]": 23,
    ".": 24,
    "[Cl]": 25,
    "[C@@H1]": 26,
    "[NH1]": 27,
    "[#N]": 28,
    "[P]": 29,
    "[C@H1]": 30,
    "[=Ring1]": 31,
    "[Br]": 32,
    "[/N]": 33,
    "[=Ring2]": 34,
    "[N+1]": 35,
    "[O-1]": 36,
    "[=N+1]": 37,
    "[I]": 38,
    "[\\O]": 39,
    "[\\N]": 40,
    "[OH0]": 41,
    "[C@]": 42,
    "[S+1]": 43,
    "[C@@]": 44,
    "[=P]": 45,
    "[C-1]": 46,
    "[#N+1]": 47,
    "[=S]": 48,
    "[Se]": 49,
    "[/O]": 50,
    "[Branch3]": 51,
    "[/C@@H1]": 52,
    "[Li+1]": 53,
    "[-\\Ring2]": 54,
    "[\\NH1]": 55,
    "[=N-1]": 56,
    "[NH1+1]": 57,
    "[N-1]": 58,
    "[2H]": 59,
    "[Na+1]": 60,
    "[\\S]": 61,
    "[/S]": 62,
    "[I-1]": 63,
    "[Br-1]": 64,
    "[Si]": 65,
    "[-/Ring2]": 66,
    "[/-Ring1]": 67,
    "[\\-Ring1]": 68,
    "[Cl-1]": 69,
    "[N@]": 70,
    "[/N+1]": 71,
    "[B]": 72,
    "[\\Cl]": 73,
    "[/C@H1]": 74,
    "[/Cl]": 75,
    "[\\F]": 76,
    "[Au]": 77,
    "[Zn+2]": 78,
    "[/F]": 79,
    "[Hg]": 80,
    "[=S+1]": 81,
    "[11CH3]": 82,
    "[/NH1]": 83,
    "[S@+1]": 84,
    "[\\C@H1]": 85,
    "[S@@+1]": 86,
    "[K+1]": 87,
    "[#C-1]": 88,
    "[N@@+1]": 89,
    "[S@@]": 90,
    "[\\C@@H1]": 91,
    "[/C@]": 92,
    "[B-1]": 93,
    "[C][=C]": 94,
    "[C][C]": 95,
    "[C][=C][C][=C]": 96,
    "[Branch1][C]": 97,
    "[Ring2][Ring1]": 98,
    "[=Branch1][C]": 99,
    "[N][C]": 100,
    "[C][=N]": 101,
    "[Ring1][=Branch1]": 102,
    "[C][Branch1]": 103,
    "[C][=C][Ring1]": 104,
    "[Branch2][Ring1]": 105,
    "[N][=C]": 106,
    "[=Branch1][C][=O]": 107,
    "[C][=C][C]": 108,
    "[Branch1][C][C]": 109,
    "[N][C][C]": 110,
    "[=C][Ring1]": 111,
    "[C][C][C]": 112,
    "[N][C][=C][C][=C]": 113,
    "[Branch1][C][F]": 114,
    "[O][C]": 115,
    "[Ring1][#Branch1]": 116,
    "[Branch2][Ring2]": 117,
    "[C][=C][Ring2][Ring1]": 118,
    "[C][N]": 119,
    "[C][Ring1]": 120,
    "[C][O]": 121,
    "[C][Branch1][C]": 122,
    "[O][C][C]": 123,
    "[C][=C][Ring1][=Branch1]": 124,
    "[=C][Ring2][Ring1]": 125,
    "[C][=C][Branch1]": 126,
    "[N][C][=Branch1][C][=O]": 127,
    "[N][C][=N]": 128,
    "[=N][C]": 129,
    "[C][=C][C][=C][C]": 130,
    "[N][Branch1]": 131,
    "[N][C][=C]": 132,
    "[C][=C][C][=C][Branch1]": 133,
    "[C][=Branch1][C][=O]": 134,
    "[C][Branch2][Ring1]": 135,
    "[O][=C]": 136,
    "[O][C][=C][C][=C]": 137,
    "[C][C][C][C]": 138,
    "[C][=C][C][=N]": 139,
    "[=C][C]": 140,
    "[Ring1][Branch1]": 141,
    "[Ring2][Ring2]": 142,
    "[C][=C][N][=C]": 143,
    "[Ring1][=Branch2]": 144,
    "[C][=C][Ring1][#Branch1]": 145,
    "[C][C][Ring1]": 146,
    "[Branch1][C][Cl]": 147,
    "[Branch1][C][N]": 148,
    "[Branch1][C][O]": 149,
    "[=N][Ring2][Ring1]": 150,
    "[C][=C][C][Branch1]": 151,
    "[Branch1][=Branch2]": 152,
    "[N][Branch1][C][C]": 153,
    "[C][=C][C][=C][Branch2][Ring1]": 154,
    "[=N][Ring1]": 155,
    "[=Branch2][C]": 156,
    "[Ring1][C]": 157,
    "[N][Ring1]": 158,
    "[C][=C][C][=C][C][=C][Ring1][=Branch1]": 159,
    "[Ring1][O]": 160,
    "[Ring1][S]": 161,
    "[C][=Ring1]": 162,
    "[Ring1][#C]": 163,
    "[C][Ring2][Ring1]": 164,
    "[=N][C][=C]": 165,
    "[Ring1][=N]": 166,
    "[N][=C][Ring2][Ring1]": 167,
    "[S][C]": 168,
    "[Branch1][C][F][Branch1][C][F]": 169,
    "[C][Branch1][=Branch2]": 170,
    "[C][C][Branch1][C][C]": 171,
    "[C][=C][C][Branch2][Ring1]": 172,
    "[N][=C][Branch1]": 173,
    "[Branch1][=C]": 174,
    "[=Branch1][Ring2]": 175,
    "[C][=N][C]": 176,
    "[N][=C][Ring1]": 177,
    "[Ring1][=Branch1][C]": 178,
    "[C][C][=C][C][=C]": 179,
    "[N][C][=C][C][=C][Branch1]": 180,
    "[C][C][=N]": 181,
    "[Ring1][=C]": 182,
    "[C][=C][Ring1][=Branch1][C]": 183,
    "[/C][=C]": 184,
    "[Branch2][Branch1]": 185,
    "[=N][N]": 186,
    "[Ring1][#Branch2]": 187,
    "[Branch1][Ring1]": 188,
    "[N][Ring2][Ring1]": 189,
    "[Ring2][Ring1][Ring1]": 190,
    "[#Branch2][C]": 191,
    "[=Branch1][C][=O][=Branch1][C][=O]": 192,
    "[C][=C][Branch2][Ring1]": 193,
    "[N][C][C][N]": 194,
    "[=C][Ring1][#Branch1]": 195,
    "[Ring1][Ring1]": 196,
    "[C][N][C][C]": 197,
    "[C][=C][C][=C][C][=C][Ring1]": 198,
    "[O][C][=Branch1][C][=O]": 199,
    "[C][C][Ring2][Ring1]": 200,
    "[Branch1][C][C][C]": 201,
    "[C][C][=C]": 202,
    "[Branch1][C][F][F]": 203,
    "[C][Branch1][C][F]": 204,
    "[Ring2][Ring1][Ring2]": 205,
    "[N][=C][N][=C]": 206,
    "[C][C][C][Ring1]": 207,
    "[=C][Ring1][=Branch1]": 208,
    "[N][C][C][O][C][C]": 209,
    "[N][C][C][C]": 210,
    "[C][C][=Branch1][C][=O]": 211,
    "[Ring1][P]": 212,
    "[C][=C][C][=C][Branch2][Ring2]": 213,
    "[C][=C][C][=C][N][=C]": 214,
    "[Branch2][Ring1][Ring2]": 215,
    "[C][=C][Ring1][#Branch2]": 216,
    "[N][N][=C]": 217,
    "[C][=C][C][=C][C][Branch1]": 218,
    "[Branch1][C][N][=O]": 219,
    "[Branch1][C][F][Branch1][C][F][F]": 220,
    "[C][=C][C][Branch2][Ring2]": 221,
    "[=N][NH1]": 222,
    "[Branch1][C][O][C]": 223,
    "[=Branch1][C][=O][N][C][=C][C][=C]": 224,
    "[=C][C][=N]": 225,
    "[C][Branch1][C][Cl]": 226,
    "[=Ring2][Ring1]": 227,
    "[C][C][Ring1][#Branch1]": 228,
    "[Ring2][Ring1][#Branch1]": 229,
    "[=C][Ring1][Branch2]": 230,
    "[=C][C][=C][Ring1]": 231,
    "[C][C@H1]": 232,
    "[=C][Ring1][#Branch2]": 233,
    "[N][C][=Branch1][C][=O][C][=C][C][=C]": 234,
    "[Ring1][Branch2]": 235,
    "[C][Branch2]": 236,
    "[=C][C][=C]": 237,
    "[C][C][O]": 238,
    "[Ring2][C]": 239,
    "[C][=C][NH1]": 240,
    "[C][=C][C][=C][C][Branch2][Ring1]": 241,
    "[N][C][=C][C][=C][C][=C][Ring1][=Branch1]": 242,
    "[Branch2][C][C]": 243,
    "[N][C@H1]": 244,
    "[Branch1][#Branch2]": 245,
    "[Branch2][C]": 246,
    "[N][C][=N][C][=N]": 247,
    "[C][C@@H1]": 248,
    "[C][=N][C][Branch1]": 249,
    "[C@H1][C][C]": 250,
    "[Branch1][C][F][C][=C][Ring1][#Branch1]": 251,
    "[C][=N][Ring2][Ring1]": 252,
    "[=Branch2][C][=C][C][=C]": 253,
    "[#C][C]": 254,
    "[O][C][C][C]": 255,
    "[Branch1][C][C][C][C]": 256,
    "[N][C][C][C][C]": 257,
    "[=C][C][=C][Ring2][Ring1]": 258,
    "[Ring1][=Branch1][C][=C][Ring1]": 259,
    "[Branch2][Ring1][=Branch1]": 260,
    "[C][=C][C][=C][Ring1][#Branch1]": 261,
    "[C][=C][C][=N][C][=C][Ring1][=Branch1]": 262,
    "[C][=C][C][Branch1][C]": 263,
    "[N][=N]": 264,
    "[=Branch1][C][=O][N]": 265,
    "[C][NH1]": 266,
    "[Ring1][C][#N]": 267,
    "[NH1][C][=C][C]": 268,
    "[Branch1][C][Br]": 269,
    "[=C][Ring1][=Branch2]": 270,
    "[Branch2][Ring2][Ring1]": 271,
    "[N][C][=C][Branch1]": 272,
    "[C][C][N]": 273,
    "[Ring1][=Branch1][=C]": 274,
    "[C][C][C@H1]": 275,
    "[C][N][Branch1][C][C]": 276,
    "[N][C][=C][C][=C][Branch1][C][F]": 277,
    "[=Branch1][C][=O][N][C][C]": 278,
    "[S][=Branch1][C][=O][=Branch1][C][=O]": 279,
    "[C][=C][Ring2][Ring1][Ring1]": 280,
    "[C][=C][C][=C][Branch1][C][F]": 281,
    "[Ring1][N]": 282,
    "[C][=C][Ring1][=N]": 283,
    "[C][Branch2][Ring2]": 284,
    "[Ring1][Branch1][C]": 285,
    "[Ring2][Ring1][Branch2]": 286,
    "[C][Branch1][C][C]": 287,
    "[C][=C][Branch1][=Branch1][C]": 288,
    "[C][=C][Branch1][C]": 289,
    "[C][=N][C][=N]": 290,
    "[NH1][N][=C]": 291,
    "[=Ring1][Branch1]": 292,
    "[Ring2][Ring1][=Branch1]": 293,
    "[N][C][=C][C][=C][C]": 294,
    "[C][S]": 295,
    "[C@H1][Branch1]": 296,
    "[N][C@@H1]": 297,
    "[#Branch1][C]": 298,
    "[Branch1][C][N][C]": 299,
    "[N][C][C][N][Branch1][C][C]": 300,
    "[C][=C][Ring1][=Branch2]": 301,
    "[C][=C][Ring1][S]": 302,
    "[N][=O]": 303,
    "[N][C][=N][C][=C]": 304,
    "[C][=C][Ring1][#C]": 305,
    "[=Branch1][C][=O][=O]": 306,
    "[O][C][C][Ring1][=Branch1]": 307,
    "[C][=C][C][=C][C][=Branch1][Ring2]": 308,
    "[N][C][=Branch1][C][=O][N][C][=C][C][=C]": 309,
    "[Branch1][=N]": 310,
    "[Branch2][Ring1][#Branch2]": 311,
    "[N][#C]": 312,
    "[=C][Branch1]": 313,
    "[Branch2][Ring1][Ring1]": 314,
    "[O][C][=C][C][=C][Branch2][Ring1]": 315,
    "[O][C][=C]": 316,
    "[=N][N][C][=C][C][=C]": 317,
    "[C][N][C][=Branch1][C][=O]": 318,
    "[C][Branch1][#Branch2]": 319,
    "[O][C][=N]": 320,
    "[Ring1][=Branch1][=C][Ring1]": 321,
    "[C][Ring1][Branch1]": 322,
    "[Ring2][Ring2][Ring1]": 323,
    "[C][Branch1][C][C][Branch1][C][C]": 324,
    "[=C][Ring1][P]": 325,
    "[C][=C][Ring1][P]": 326,
    "[N][=Ring1]": 327,
    "[C][=C][Ring2][Ring1][=Branch1]": 328,
    "[Branch2][Ring1][Branch2]": 329,
    "[=Branch2][C][Branch1][C][F][Branch1][C][F][F]": 330,
    "[C][Branch1][=C]": 331,
    "[C][=C][C][=C][C][=C][Ring1][=Branch1][C]": 332,
    "[C@@H1][Branch1]": 333,
    "[C][=C][Ring1][Branch2]": 334,
    "[=N][C][=N]": 335,
    "[Branch2][Ring1][#Branch1]": 336,
    "[=C][Ring1][#C]": 337,
    "[Branch1][C][Cl][C][=C][Ring1][#Branch1]": 338,
    "[=Branch1][C][Branch1][C][N][=O]": 339,
    "[C][=C][C][Branch1][C][F]": 340,
    "[C][=Branch1][C][=O][N][C][C]": 341,
    "[C][=C][C][=C][C][Branch2][Ring2]": 342,
    "[N][C][=C][C]": 343,
    "[C][=C][Ring2][Ring1][#Branch1]": 344,
    "[Ring2][Ring1][=Branch2]": 345,
    "[Ring2][C][C]": 346,
    "[Ring2][Ring1][#Branch2]": 347,
    "[=Branch1][C][=Branch1][C][=O]": 348,
    "[C][=C][Ring2][Ring1][=Branch2]": 349,
    "[P][C]": 350,
    "[C][=C][Ring1][=C]": 351,
    "[O][=C][Branch2][Ring1]": 352,
    "[Branch2][Ring2][#Branch1]": 353,
    "[N][N][C][C]": 354,
    "[C][=C][C][=C][C][=N]": 355,
    "[C][=C][Ring2][Ring1][Branch2]": 356,
    "[=C][C][Branch1]": 357,
    "[Branch2][Ring2][Ring2]": 358,
    "[=C][Ring2][Ring1][Ring2]": 359,
    "[N][C][=C][C][=C][Branch2][Ring1]": 360,
    "[S][Branch1][C][C]": 361,
    "[Branch1][O]": 362,
    "[Ring2][Ring1][Branch1]": 363,
    "[C][=C][Branch2][Ring2]": 364,
    "[Ring2][Ring1][#C]": 365,
    "[C][O][C][=C][C][=C]": 366,
    "[#C][C][=C][C][=C]": 367,
    "[N][=C][Branch2][Ring1]": 368,
    "[N][C][=C][C][Branch1]": 369,
    "[N][C][=C][C][=C][C][Branch1]": 370,
    "[C][=C][C][=C][Branch1][=Branch2]": 371,
    "[C][=Branch1][C][=O][N][C][=C][C][=C]": 372,
    "[=Branch1][Ring2][=C][Ring1][=Branch1]": 373,
    "[N][C][=C][N][=C]": 374,
    "[S][Ring2][Ring1]": 375,
    "[C][Ring1][#C]": 376,
    "[Ring2][Ring1][C]": 377,
    "[C][=C][N]": 378,
    "[N][C][C][N][C][C]": 379,
    "[=C][Ring1][S]": 380,
    "[N][C][C][O][C][C][Ring1][=Branch1]": 381,
    "[Ring1][Ring2]": 382,
    "[NH1][Ring2][Ring1]": 383,
    "[O][C][O]": 384,
    "[=N][C][Branch1]": 385,
    "[N][=C][Ring1][=Branch1]": 386,
    "[Branch2][Ring2][Branch1]": 387,
    "[Branch1][C][O][C][=C][Ring1][#Branch1]": 388,
    "[C][=N][C][Branch2][Ring1]": 389,
    "[Branch2][Ring2][Branch2]": 390,
    "[C][=C][S]": 391,
    "[N][C][C][C][C][C]": 392,
    "[C][=C][Ring2][Ring1][#Branch2]": 393,
    "[C][Branch2][Ring1][Ring2]": 394,
    "[C][C][C][N][C][C]": 395,
    "[O][C][=C][C][=N]": 396,
    "[S][C][=N]": 397,
    "[Ring1][=Branch1][=N][Ring1]": 398,
    "[C][Branch1][P]": 399,
    "[C][=Branch1][C][=O][N][C]": 400,
    "[Ring1][#Branch1][=C]": 401,
    "[C][=N][C][=C]": 402,
    "[Branch1][C][=Branch1][C][=O]": 403,
    "[Ring2][Ring1][S]": 404,
    "[Ring1][=Branch1][C][C]": 405,
    "[C][=C][Branch1][=Branch2]": 406,
    "[N][C][=Branch1][C][=O][C]": 407,
    "[=C][Ring2][Ring1][#Branch1]": 408,
    "[Branch2][Ring1][=Branch2]": 409,
    "[C][=C][Ring1][N]": 410,
    "[C][=C][Ring2][Ring1][Branch1]": 411,
    "[N][C][=C][C][=N]": 412,
    "[N][C][=C][C][=C][Branch1][=Branch2]": 413,
    "[C][=C][Ring2][Ring1][Ring2]": 414,
    "[N][C][C][C][Ring1]": 415,
    "[C][=C][Ring1][O]": 416,
    "[N][C][=N][C][Branch1]": 417,
    "[Branch1][C][C][Branch1][C][C]": 418,
    "[N][C][=N][C][=C][C][Branch1]": 419,
    "[C][=C][Ring2][Ring2]": 420,
    "[C][C][C][Ring1][Ring1]": 421,
    "[C][C][C][C][C]": 422,
    "[Branch2][Ring1][#C]": 423,
    "[O][=C][Branch1]": 424,
    "[Ring2][Ring2][Ring2]": 425,
    "[Ring2][Ring1][P]": 426,
    "[=N][C][=Branch1][C][=O]": 427,
    "[O][N][C][=Branch1][C][=O]": 428,
    "[C][=C][C][=C][Branch1][#Branch2]": 429,
    "[C][Branch1][C][Br]": 430,
    "[Ring2][Ring1][=C]": 431,
    "[Branch2][Ring2][#Branch2]": 432,
    "[Branch2][Ring2][=Branch1]": 433,
    "[=Branch1][C][Branch1][C][C]": 434,
    "[C][=C][Branch1][C][F]": 435,
    "[N][C][Branch1]": 436,
    "[N][=Ring2]": 437,
    "[NH1][C][=Ring1]": 438,
    "[N][Branch2][Ring2]": 439,
    "[NH1][C][=N]": 440,
    "[O][C][=C][C][=C][C][=C][Ring1][=Branch1]": 441,
    "[=N][C][=C][Ring2][Ring1]": 442,
    "[C][=C][C][=C][C][=Branch1][Ring2][=C][Ring1][=Branch1]": 443,
    "[N][C][C][N][Branch1][C][C][C][C][Ring1][#Branch1]": 444,
    "[C][=C][Branch1][C][Cl]": 445,
    "[N][C][=N][C][=C][Branch1]": 446,
    "[N][Branch1][C][C][C][C]": 447,
    "[C][C][Ring2][Ring2]": 448,
    "[Ring1][=Branch1][=N]": 449,
    "[=Ring1][Branch1][C]": 450,
    "[C][N][C][=N]": 451,
    "[Ring1][O][C]": 452,
    "[C][Branch1][=N]": 453,
    "[N][Branch1][=Branch2]": 454,
    "[=C][Ring2][Ring1][Ring1]": 455,
    "[Branch1][#Branch1]": 456,
    "[#Branch1][C][C]": 457,
    "[/C][=C][/C]": 458,
    "[=N][Ring1][#C]": 459,
    "[C][Ring1][=C]": 460,
    "[Ring2][Ring1][=N]": 461,
    "[C][Branch1][S]": 462,
    "[=Branch1][C][=O][N][C]": 463,
    "[Branch1][S]": 464,
    "[O][N][C]": 465,
    "[C][=C][C][=C][C][Branch1][C][F]": 466,
    "[C][Ring1][=Branch2]": 467,
    "[N][C][=N][C][=C][C]": 468,
    "[C][Branch1][C][O]": 469,
    "[=C][Ring2][Ring1][Branch2]": 470,
    "[N][C][C][N][Branch1]": 471,
    "[C][=C][Branch1][C][C]": 472,
    "[Branch2][Ring1][Branch1]": 473,
    "[Branch2][Ring2][=Branch2]": 474,
    "[C][N][C]": 475,
    "[N][C][C@@H1]": 476,
    "[=C][Ring2][Ring1][#Branch2]": 477,
    "[C][=C][N][Branch1]": 478,
    "[=N][Ring2][Ring1][Ring2]": 479,
    "[Branch1][C][Cl][=C]": 480,
    "[C][Branch1][C][Cl][=C][Ring1][#Branch1]": 481,
    "[N][Ring1][=Branch2]": 482,
    "[N][C][=C][C][=C][Branch1][C][F][C][=C][Ring1][#Branch1]": 483,
    "[C][C][N][C]": 484,
    "[C][=N][Ring1][=Branch1]": 485,
    "[Branch1][N]": 486,
    "[S][C][=Ring1]": 487,
    "[Branch1][Branch2]": 488,
    "[N][Ring1][Branch1][C]": 489,
    "[Branch2][C][=N]": 490,
    "[C][=N][NH1]": 491,
    "[=N][Ring1][S]": 492,
    "[C][=Ring1][Branch1]": 493,
    "[=C][Ring1][O]": 494,
    "[C][O][C][C]": 495,
    "[Branch1][C][O][C][C]": 496,
    "[C][=C][Ring2][Ring1][O]": 497,
    "[N][C][C][N][Branch2][Ring2]": 498,
    "[C][=C][C][=N][C][Branch1]": 499,
    "[N][C][=N][C][Branch2][Ring1]": 500,
    "[=N][Ring1][=Branch1]": 501,
    "[S][Ring1]": 502,
    "[Ring1][=Branch1][=C][Ring1][#Branch2]": 503,
    "[C][Ring1][P]": 504,
    "[=C][Ring2][Ring2]": 505,
    "[Branch2][N][C][=Branch1][C][=O]": 506,
    "[C][C][N][Branch1]": 507,
    "[C][O][C][=C][C][=C][Branch2][Ring1]": 508,
    "[N][Branch1][C][C][C][=Branch1][C][=O]": 509,
    "[N][Branch1][C][C][C]": 510,
    "[C][Branch1][C][Cl][=C][Ring1][Branch2]": 511,
    "[N][C][C][C][C][Ring1][Branch1]": 512,
    "[=Ring1][=Branch2]": 513,
    "[N][C][=Branch1][C][=O][N][C][C]": 514,
    "[C][C][C][N][C]": 515,
    "[=C][C][C]": 516,
    "[N][C][C][=C]": 517,
    "[/C][=C][\\C]": 518,
    "[N][=C][Ring1][#Branch1]": 519,
    "[=C][C][=C][Ring1][#Branch1]": 520,
    "[N][C][C][=C][C][=C]": 521,
    "[O][C][=C][C][=C][Branch2][Ring2]": 522,
    "[N][Branch2][Ring1]": 523,
    "[N][C][=C][C][=C][C][Branch2][Ring1]": 524,
    "[N][=C][Ring1][S]": 525,
    "[C@@H1][Branch1][C][C]": 526,
    "[#C][N][C][=N]": 527,
    "[C][Branch1][#C]": 528,
    "[C][Ring1][S]": 529,
    "[C][=C][C][=C][Branch1][C][F][C][=C][Ring1][#Branch1]": 530,
    "[C][=C][C][Branch1][=Branch2]": 531,
    "[N][C][Branch1][C][C]": 532,
    "[C][=C][C][=C][Ring1][=Branch1]": 533,
    "[Branch1][C][F][C][=C][C][=C][Ring1][#Branch1]": 534,
    "[=C][N][=C][Ring2][Ring1]": 535,
    "[N][C][C][C][Branch1]": 536,
    "[N][C][=C][C][Branch2][Ring1]": 537,
    "[O][C][C][O]": 538,
    "[O][C][Branch1]": 539,
    "[C][=C][Branch1][=Branch1][C][Branch1][C][N][=O]": 540,
    "[C][=C][Branch1][C][N]": 541,
    "[C][=C][C][=C][Ring1][#Branch1][F]": 542,
    "[O][Ring2][Ring1]": 543,
    "[=C][\\C]": 544,
    "[N][C][C][N][Branch2][Branch1]": 545,
    "[N][=C][N][=C][Ring1][#Branch1]": 546,
    "[N][N][C][=Branch1][C][=O]": 547,
    "[N][=C][N][=C][Ring2][Ring1]": 548,
    "[N][C][C][C][C][Ring1]": 549,
    "[/C][=Branch1]": 550,
    "[NH1][C][Branch1]": 551,
    "[S][Branch1][C][C][=Branch1][C][=O][=O]": 552,
    "[C][=C][C][=C][N][=C][Ring1][=Branch1]": 553,
    "[C@H1][C][C][C@H1]": 554,
    "[=C][Ring2][Ring1][=Branch2]": 555,
    "[=N][N][Ring1]": 556,
    "[C][Branch1][O]": 557,
    "[C][=C][C][=N][C][Branch2][Ring1]": 558,
    "[N][C][=Branch1][C][=O][C][=C][C][=C][Branch1]": 559,
    "[Ring1][C][O]": 560,
    "[N][C][C][O][C][C][Ring1][=Branch1][C][=C][Ring1]": 561,
    "[Branch2][C][C][=N]": 562,
    "[Branch2][Ring1][O]": 563,
    "[Branch2][Ring1][=C]": 564,
    "[=Branch1][C][=O][O-1]": 565,
    "[=Ring1][Branch1][C][C]": 566,
    "[=Branch1][C][=N]": 567,
    "[=C][Ring1][=Branch1][C]": 568,
    "[=N][Ring2][Ring1][Ring1]": 569,
    "[N][Branch1][C][C][C][=Ring1]": 570,
    "[NH1][C][Branch2][Ring1]": 571,
    "[C][=C][C][=C][Ring1][#Branch1][Cl]": 572,
    "[C][Branch2][Ring1][Branch1]": 573,
    "[C][=C][Ring1][#Branch1][F]": 574,
    "[N][C][N][=C]": 575,
    "[S][N][C][=Branch1][C][=O]": 576,
    "[Branch2][Ring1][P]": 577,
    "[=N][Ring1][P]": 578,
    "[C][=N][C][=N][C]": 579,
    "[C][Branch2][Ring1][Ring1]": 580,
    "[#Branch2][C][=Branch1][C][=O]": 581,
    "[N][C][=N][C][=C][C][Branch2][Ring1]": 582,
    "[C][=C][C][=C][C][=C][Ring1][=Branch1][Cl]": 583,
    "[=Branch1][Ring2][=N]": 584,
    "[Branch1][Ring1][C][O]": 585,
    "[C][=C][C][Branch1][C][Cl]": 586,
    "[Branch1][#C]": 587,
    "[C][C][C@@H1]": 588,
    "[C][=C][Ring2][Ring1][#C]": 589,
    "[#C][N][C][=Branch1][C][=O]": 590,
    "[C][=C][Ring2][Ring1][=N]": 591,
    "[F][=C]": 592,
    "[C][C][Branch1][C][C][Branch1][C][C]": 593,
    "[=C][C][=Branch1][C][=O]": 594,
    "[=C][Ring2][Ring1][=Branch1]": 595,
    "[C@H1][Branch1][C][C]": 596,
    "[=Branch1][C][=O][O]": 597,
    "[/C][=C][/C][=C]": 598,
    "[C][Branch1][Ring1][O]": 599,
    "[Ring2][Ring1][O]": 600,
    "[C][Branch1][C][F][Branch1][C][F][F]": 601,
    "[F][C]": 602,
    "[N][C][=Branch1][C]": 603,
    "[=C][NH1]": 604,
    "[C][=C][Ring2][Ring1][=C]": 605,
    "[C][=C][C][=C][C][=C][Ring1][=Branch2]": 606,
    "[=N][C][=Ring1]": 607,
    "[C][Branch1][C][N]": 608,
    "[C][O][C][=C][C][=C][Branch2][Ring2]": 609,
    "[C][=N][C][=C][Branch1]": 610,
    "[=C][/C][=C]": 611,
    "[C][O][C][=C][C][=N]": 612,
    "[Branch1][=Branch2][C][=C][C][=C][C][=C][Ring1][=Branch1]": 613,
    "[C][=C][C][=Branch2]": 614,
    "[Branch2][C][=Branch1][C][=O]": 615,
    "[C][Branch2][Ring1][O]": 616,
    "[C][C][C][N]": 617,
    "[C][C][C][=N]": 618,
    "[Branch1][C][O][C][=C][C][=C]": 619,
    "[C][Branch2][Ring1][=Branch2]": 620,
    "[=C][Ring2][Ring1][Branch1]": 621,
    "[O][C][C@@H1]": 622,
    "[C][=C][C][=C][Branch2][Ring1][Branch2]": 623,
    "[N][C][=Branch1][C][=O][/C]": 624,
    "[=Branch2][C][Branch1][C][F][Branch1][C][F][F][=C][Ring1][#Branch2]": 625,
    "[C][Ring1][=Branch1]": 626,
    "[=N][C][C]": 627,
    "[Branch1][=Branch1]": 628,
    "[N][C][C][Ring1][=Branch1]": 629,
    "[C][C][=N][NH1]": 630,
    "[/N][=C]": 631,
    "[C][=C][C][Branch1][Ring1][O]": 632,
    "[C][Ring1][Branch1][=C][Ring1][=Branch2]": 633,
    "[C][C][C][N][Branch1]": 634,
    "[C][C][=C][C]": 635,
    "[=Ring1][#Branch2]": 636,
    "[C][=C][C][=C][C][Branch1][C]": 637,
    "[N][O][C][C]": 638,
    "[C][C][C][Ring1][Branch1][C]": 639,
    "[C][C][C][=Branch1][C][=O]": 640,
    "[N][=C][Ring2][Ring1][Ring1]": 641,
    "[NH1][C][=C][C][Ring1][=Branch2]": 642,
    "[=C][N][C][=C][C][=C]": 643,
    "[C][=C][C][Branch1][C][O][=C]": 644,
    "[N][C][=C][C][=C][Branch1][=C]": 645,
    "[Ring1][O][C][C]": 646,
    "[Branch2][Ring1][=N]": 647,
    "[=C][S]": 648,
    "[S][Ring1][Branch1]": 649,
    "[O][C][=C][C][Branch1]": 650,
    "[N][C][=C][Branch1][=Branch1][C][Branch1][C][N][=O]": 651,
    "[/C][=Branch2]": 652,
    "[O][C][=C][C][=C][Branch1]": 653,
    "[C][=N][C][NH1]": 654,
    "[=C][/C]": 655,
    "[C][=C][C][Branch2][Ring1][Ring1]": 656,
    "[C][=C][N][=C][Branch1]": 657,
    "[O][C][=C][C]": 658,
    "[#C][C][=Branch1][C][=O]": 659,
    "[P][N][C][=Branch1][C][=O]": 660,
    "[C][=C][C][Branch1][C][F][=C]": 661,
    "[P][C][=Branch1][C][=O]": 662,
    "[C][=C][C][=C][Ring1][=N]": 663,
    "[N][Ring1][Branch1]": 664,
    "[=C][C][=C][C][=C]": 665,
    "[C][Branch2][Ring1][Branch2]": 666,
    "[O][C][C][=N]": 667,
    "[O][O][C][C]": 668,
    "[N][Ring1][S]": 669,
    "[N][C][=N][C][=C][C][=C]": 670,
    "[N][=C][Ring2][Ring1][=Branch1]": 671,
    "[Ring1][=Branch1][=C][Ring2][Ring1]": 672,
    "[P][C][C]": 673,
    "[N][Branch1][C][C][C][C][Ring1][#Branch1]": 674,
    "[C][=C][C][=C][NH1]": 675,
    "[=Branch1][N+1]": 676,
    "[C][C][Ring1][Branch2]": 677,
    "[=C][N][C][=Branch1][C][=O]": 678,
    "[=C][Ring2][Ring1][O]": 679,
    "[=N][C][=C][C][=C]": 680,
    "[C@H1][Branch1][C]": 681,
    "[Branch2][Ring1][S]": 682,
    "[N][N][C][C][N][Branch1][C][C][C][C][Ring1][#Branch1]": 683,
    "[N][=C][Branch1][=Branch2]": 684,
    "[N][C][=N][C][=C][Branch1][C][Cl]": 685,
    "[C][Ring1][#Branch1]": 686,
    "[=N][N][C][=Branch1][C][=O]": 687,
    "[C][=C][Branch1][=C]": 688,
    "[NH1][C][=C][C][Ring1][Branch1]": 689,
    "[Branch1][C][Br][C][=C][Ring1][#Branch1]": 690,
    "[C][=C][Branch1][#Branch2]": 691,
    "[C][Branch1][Branch2]": 692,
    "[Branch2][C][=C][C][=C]": 693,
    "[Branch2][Ring1][N]": 694,
    "[C][C][Ring1][=N]": 695,
    "[Branch1][Ring1][C]": 696,
    "[Branch1][C][F][=C][Ring1][#Branch1]": 697,
    "[N][C][C][O][C][C][Ring1][=Branch1][C]": 698,
    "[Ring2][Ring1][C][C]": 699,
    "[C][Ring2][Ring1][#Branch1]": 700,
    "[N][Branch1][Branch2][C][C]": 701,
    "[C][=C][Ring2][Ring1][N]": 702,
    "[S][Ring1][=Branch2]": 703,
    "[O][C@H1]": 704,
    "[N][S][=Branch1][C][=O][=Branch1][C][=O]": 705,
    "[C][=N][N][Branch1]": 706,
    "[NH1][C][=Branch1][C][=O]": 707,
    "[Ring1][C][#N][C][=N]": 708,
    "[C][=C][C][Branch1][S]": 709,
    "[#C][N][C][=C][C][=C]": 710,
    "[C][=C][C][=C][Branch1][S]": 711,
    "[C][=N][C][=C][C][=C]": 712,
    "[C][Ring1][=N]": 713,
    "[C][=C][C][=C][C][=C][Ring1][=Branch1][S]": 714,
    "[C][Branch1][=Branch2][C][Branch1][C][F][Branch1][C][F][F]": 715,
    "[S][C][=Branch1][C][=O]": 716,
    "[=N][Ring2][Ring1][#Branch2]": 717,
    "[O][C@@H1]": 718,
    "[#C][C][C]": 719,
    "[#Branch2][C][C]": 720,
    "[C][Branch1][C][N][=O]": 721,
    "[C][=C][C][=C][Branch2][Ring1][#Branch2]": 722,
    "[=C][C][=C][N][=C]": 723,
    "[N][=C][N][=C][Ring1][#C]": 724,
    "[=C][Ring2][Ring1][C]": 725,
    "[C][=C][C][=Branch1][C][=O]": 726,
    "[N][C][C@H1]": 727,
    "[N][C][=N][NH1]": 728,
    "[C][C][N][C][C]": 729,
    "[C][=C][C][=C][C][Branch1][C][F][=C][Ring1][#Branch1]": 730,
    "[C][=C][C][=C][Branch1][=C]": 731,
    "[=C][Ring1][=C]": 732,
    "[N][Branch1][Ring1]": 733,
    "[N][C][=Branch1][C][=O][C][=C][N][=C]": 734,
    "[=Ring1][=Branch1]": 735,
    "[=C][N][=C]": 736,
    "[=N][Ring2][Ring1][#Branch1]": 737,
    "[N][C][=Branch1][C][=O][N][C]": 738,
    "[=C][Ring1][=N]": 739,
    "[C][=C][C][Branch1][P]": 740,
    "[O][O][C]": 741,
    "[C][Branch2][Ring1][#Branch2]": 742,
    "[Ring1][=Branch1][N]": 743,
    "[C][C][Ring1][=Branch1]": 744,
    "[C][Branch2][Ring1][=Branch1]": 745,
    "[C][Branch1][C][N][=C]": 746,
    "[N][C][=C][C][=C][Branch1][P]": 747,
    "[C][=C][C][=C][Branch1][C][O][C][=C][Ring1][#Branch1]": 748,
    "[N][N][=C][Branch1]": 749,
    "[C][=C][C][=C][Branch1][C][Cl][C][=C][Ring1][#Branch1]": 750,
    "[Ring1][=Branch1][=N][Ring2][Ring1]": 751,
    "[C][=C][N][=C][C][Branch2][Ring1]": 752,
    "[N][C][C][C][N]": 753,
    "[O][C][=C][Ring1]": 754,
    "[C][=N][C][Branch1][C]": 755,
    "[C][Branch1][=N][C][=C]": 756,
    "[N][C][=C][C][=C][Branch1][S]": 757,
    "[Branch2][Branch1][Ring2]": 758,
    "[C][Ring1][#Branch2]": 759,
    "[N][=C][Ring1][P]": 760,
    "[C][=C][C][=C][C][=C][Ring1][=Branch1][=C]": 761,
    "[C][Branch1][=Branch2][C][=C][C][=N][C][=C][Ring1][=Branch1]": 762,
    "[C][Branch1][N]": 763,
    "[C][=Branch1][Ring2]": 764,
    "[C][O][C][=C][C][Branch1]": 765,
    "[NH1][Ring1]": 766,
    "[=C][N]": 767,
    "[C][O][C][=C][C][Branch2][Ring1]": 768,
    "[C][Branch2][Ring1][#Branch1]": 769,
    "[N][C][=C][C][=C][C][=Branch1][Ring2][=C][Ring1][=Branch1]": 770,
    "[Branch1][C][N][C][C]": 771,
    "[=N][O]": 772,
    "[=Branch2][C][=C][C][=C][C][=C][Ring1][=Branch1][C]": 773,
    "[C][=C][C][=C][Branch2][Ring1][=Branch2]": 774,
    "[C][=Branch1][C][=O][O][C]": 775,
    "[NH1][Ring1][=Branch2]": 776,
    "[C][=C][Ring2][Ring1][C]": 777,
    "[C][Branch1][C][F][=C][Ring1][#Branch1]": 778,
    "[N][=Ring2][Ring1]": 779,
    "[=C][C][=C][NH1]": 780,
    "[N][Branch1][#Branch2]": 781,
    "[=C][Ring2][Ring1][#C]": 782,
    "[Branch2][Ring2][P]": 783,
    "[Ring1][O][C][=C][Ring2][Ring1]": 784,
    "[C][Branch1][=Branch2][C][=C][C][=C][C][=C][Ring1][=Branch1]": 785,
    "[C][C][C][O]": 786,
    "[N][C@H1][C][C][C@H1]": 787,
    "[C][Branch1][C][F][=C][Ring1][Branch2]": 788,
    "[Branch2][Branch1][=Branch1]": 789,
    "[N][=C][Ring1][#Branch2]": 790,
    "[C][N][Branch1]": 791,
    "[C][=C][C][=C][C][=C][Ring1][#Branch2]": 792,
    "[C][=C][C][=C][C][=C][Ring1][=Branch1][N][Ring2][Ring1]": 793,
    "[N][C][=Branch1][C][=O][C][=C][C][=C][Branch1][C][F]": 794,
    "[C][=C][C][=C][Branch1][P]": 795,
    "[Branch1][C][=N]": 796,
    "[N][C][=N][C][=C][Branch2][Ring1]": 797,
    "[N][=C][Ring1][#C]": 798,
    "[N][C][C][C][C@@H1]": 799,
    "[C][=C][C][=N][C][NH1]": 800,
    "[N][C][C][C][Ring1][Ring1]": 801,
    "[=N][Ring2][Ring1][=Branch2]": 802,
    "[=Branch1][C][C][C][Ring1][Ring1]": 803,
    "[=O][C]": 804,
    ".[Cl]": 805,
    "[=N][C][=C][Branch1][C][Cl]": 806,
    "[S][N][C][=C][C][=C]": 807,
    "[=O][=C]": 808,
    "[Ring2][Ring2][C][C]": 809,
    "[C][=N][C][NH1][C][=C][C]": 810,
    "[C][=C][Branch2][Ring1][Ring1]": 811,
    "[C][C][C][C][C][C]": 812,
    "[C][=C][C][=C][Branch1][C][Cl]": 813,
    "[C][O][C][=C][C][=C][Branch1]": 814,
    "[Ring2][Ring2][=Branch1]": 815,
    "[Branch2][Branch1][Ring1]": 816,
    "[S][C][Ring2][Ring1]": 817,
    "[#C][C][=C][N][=C]": 818,
    "[=Ring1][O]": 819,
    "[N][Ring1][P]": 820,
    "[Branch2][Ring2][S]": 821,
    "[C][Branch1][C][Br][=C][Ring1][#Branch1]": 822,
    "[=Branch2][C][=C][C][=C][C][=C][Ring1][=Branch1]": 823,
    "[NH1][C][Ring1]": 824,
    "[C][=C][Ring2][Ring1][S]": 825,
    "[O][C][=C][C][=C][Ring1][#Branch1]": 826,
    "[C][Branch1][C][C][Branch1][C][C][C]": 827,
    "[C][=C][Branch1][#C]": 828,
    "[C][=C][Branch2][Ring1][Ring2]": 829,
    "[N][=N][Ring2][Ring1]": 830,
    "[O][=C][N][C][=Branch1][C][=O]": 831,
    "[Branch1][N][C][=Branch1][C][=O]": 832,
    "[N][C][C][C][N][C][C]": 833,
    "[N][C][=C][C][=C][Branch1][C][Cl][C][=C][Ring1][#Branch1]": 834,
    "[C@H1][C][C@@H1]": 835,
    "[C][=C][N][C]": 836,
    "[C][Ring2][Ring1][=Branch1]": 837,
    "[C][C][O][C]": 838,
    "[Branch1][C][C][=Branch1][C][=O]": 839,
    "[#Branch1][C][=Branch1][C][=O]": 840,
    "[C@H1][Branch2][Ring2]": 841,
    "[=N][Ring2][Ring2]": 842,
    "[O][C][Branch1][C][F][Branch1][C][F][F]": 843,
    "[C][C][Ring1][#Branch2]": 844,
    "[C][C][Branch1]": 845,
    "[Branch1][C][F][C][=C][C][=C][Ring1][#Branch1][F]": 846,
    "[Branch2][Ring1][C]": 847,
    "[=Branch2][Ring1]": 848,
    "[Ring2][Ring1][N]": 849,
    "[N][C][=C][Branch2][Ring1]": 850,
    "[Branch2][Ring2][C]": 851,
    "[S][C][C]": 852,
    "[C][=C][C][=N][C][=N]": 853,
    "[C][=C][C][=Branch1][C][=O][N][C][=C][C][=C]": 854,
    "[C][Branch1][C][N][C][C]": 855,
    "[Branch2][Ring2][=C]": 856,
    "[C][=C][Branch1][C][O]": 857,
    "[N][=C][C][Ring1]": 858,
    "[=Branch2][C][C]": 859,
    "[N][C][=C][C][=C][Branch1][C][Cl]": 860,
    "[C][=C][Ring2][Ring1][=Branch1][C]": 861,
    "[C][=N][N][=C]": 862,
    "[C][O][C][=C][C][Branch2][Ring2]": 863,
    "[C][C][Ring2][Ring1][#C]": 864,
    "[Ring2][Ring1][=Branch1][C]": 865,
    "[C][=C][C][=C][Branch1][=Branch2][C][Branch1][C][F][Branch1][C][F][F]": 866,
    "[S][N][C][=C][C][=C][Branch1][C][F]": 867,
    "[Ring1][#C][=O]": 868,
    "[Branch1][C][O][C][Branch1][C][Cl]": 869,
    "[C][=C][Ring2][Ring1][P]": 870,
    "[Ring1][Branch1][C][C]": 871,
    "[NH1][N][=Ring1]": 872,
    "[O][C][C][=Branch1][C][=O]": 873,
    "[N][C][=N][C][=N][C][=C][Ring1][=Branch1][C]": 874,
    "[C][=C][C][=C][Branch1][#C]": 875,
    "[=C][Ring2][Ring1][=C]": 876,
    "[=C][Ring2][Ring1][=N]": 877,
    "[=N][Ring2][Ring1][=Branch1]": 878,
    "[O][N][=C]": 879,
    "[C][C][O][C][=Branch1][C][=O]": 880,
    "[C][=C][C][=C][Branch1][=Branch1]": 881,
    "[O][Ring1][Branch1]": 882,
    "[O][C][C@H1]": 883,
    "[C@@H1][C][C@H1]": 884,
    "[C][Ring2][Ring1][Branch2]": 885,
    "[C][=Ring2]": 886,
    "[C][=C][C][Ring1][=Branch2]": 887,
    "[C][=Branch1][C][=O][N]": 888,
    "[O][C][=C][C][=C][C][=C][Ring1][=Branch1][C]": 889,
    "[Branch2][Ring1][Branch1][C]": 890,
    "[N][S]": 891,
    "[Ring1][N][C]": 892,
    "[C][=C][C][Branch2][Ring1][Branch2]": 893,
    "[NH1][C][=C][Branch1]": 894,
    "[N][=C][Ring1][Branch1]": 895,
    "[=N][Ring2][Ring1][Branch2]": 896,
    "[Ring1][=Branch1][=O]": 897,
    "[O][=C][NH1]": 898,
    "[O][C][=Ring1]": 899,
    "[S][Branch1][C][N]": 900,
    "[Ring1][C][C][C][C]": 901,
    "[C][=C][C][Branch2][Ring1][Ring2]": 902,
    "[C][Branch1][Ring1][C][#N]": 903,
    "[N][Ring1][#C]": 904,
    "[C][=N][C][=C][C][=C][C][=C][Ring1][=Branch1]": 905,
    "[O][C][=C][C][Branch2][Ring1]": 906,
    "[C][=C][Branch1][Branch2]": 907,
    "[=O][C][C]": 908,
    "[Branch2][C][C][=N][NH1][C][=Ring1]": 909,
    "[N][=C][Ring2][Ring1][#Branch1]": 910,
    "[=N][N][Branch1]": 911,
    "[C][Branch1][#Branch1]": 912,
    "[S][C][Branch1]": 913,
    "[Ring1][C][C]": 914,
    "[F][C][=C][N][=C]": 915,
    "[C][=C][C][Branch1][C][Cl][=C]": 916,
    "[N][C][=N][C][=C][C][=C][C][=C][Ring1][=Branch1]": 917,
    "[=C][Ring2][Ring1][P]": 918,
    "[C][Branch1][C][O][=C][Ring1][#Branch1]": 919,
    "[Branch2][Branch1][#Branch1]": 920,
    "[N][C][C][C][C][C][C]": 921,
    "[C][Branch1][=Branch2][N][C][C][O][C][C]": 922,
    "[Br][=C]": 923,
    "[C][Branch1][C][C][=C][Ring1][#Branch1]": 924,
    "[C][C][N][C][=Branch1][C][=O]": 925,
    "[Ring1][Branch1][=C]": 926,
    "[N][C][=N][C][=N][C][=C][Branch1][=Branch1][C][Branch1][C][N][=O]": 927,
    "[S][C][=C][C]": 928,
    "[C][=C][Branch1][P]": 929,
    "[=C][C][Branch1][Ring1][O]": 930,
    "[=Ring1][#C]": 931,
    "[C][C][=C][C][=C][C][=C][Ring1][=Branch1][C]": 932,
    "[N][C][=C][C][Branch1][=Branch2]": 933,
    "[N][C][=C][C][=C][C][=C][Ring1][=Branch1][C]": 934,
    "[=Ring1][P]": 935,
    "[C][C][=N][N][Branch1]": 936,
    "[=C][Ring2][Ring1][O][C]": 937,
    "[Ring1][=C][=N][Ring2][Ring1]": 938,
    "[N][C][=N][C][=C][C][=C][Branch1]": 939,
    "[Branch2][=Branch1]": 940,
    "[Ring1][C][O][C]": 941,
    "[N][Branch1][C][C][C][C][C]": 942,
    "[C][=C][Branch1][C][N][N][=C][N][=C][Ring1][#Branch1]": 943,
    "[N][C][=C][C][=C][Branch1][C][F][C][Branch1][C][Cl][=C][Ring1][Branch2]": 944,
    "[P][N]": 945,
    "[C][=C][Branch1][Ring1][C][#N]": 946,
    "[Ring1][Branch1][=N]": 947,
    "[#Branch2][C][C][=C][C][=C][C][=C][Ring1][=Branch1]": 948,
    "[Branch2][Ring2][O]": 949,
    "[=Ring2][Ring1][Branch2]": 950,
    "[N][=C][Ring2][Ring1][Branch1]": 951,
    "[=C][C][=N][C][=N][C]": 952,
    "[=N][Ring1][=C]": 953,
    "[C][O][C]": 954,
    "[=C][C][=N][Ring2][Ring1]": 955,
    "[C][=C][Branch1][S]": 956,
    "[N][C][C][C][C@H1]": 957,
    "[N][C][=N][C][=N][C][=C][N][=C]": 958,
    "[O][N][C][C]": 959,
    "[=Branch1][=C]": 960,
    "[O][C][C][Ring1][#Branch1]": 961,
    "[N][C][=N][C][=N][C]": 962,
    "[N][N][C]": 963,
    "[C][=C][C][=C][Branch2][Ring1][#Branch1]": 964,
    "[#Branch1][C][C][C][C]": 965,
    "[N][C][=C][C][=C][C][=Branch1][Ring2]": 966,
    "[=N][Ring2][Ring1][Branch1]": 967,
    "[C][=Branch1][C][=O][N][Ring2][Ring1]": 968,
    "[C][Ring2][Ring1][Ring1]": 969,
    "[=C][Ring2][Ring1][=Branch1][C]": 970,
    "[=Branch2][N][C][=Branch1][C][=O]": 971,
    "[C][C][C][Branch1]": 972,
    "[N][=C][Ring2][Ring1][=Branch2]": 973,
    "[C][C][C][C][C][C][C][C]": 974,
    "[C][=C][Ring2][Ring1][Ring1][O][C][C]": 975,
    "[C][O][=C]": 976,
    "[C][C][C][Ring1][=Branch1]": 977,
    "[S][N]": 978,
    "[C][N][Branch1][C][C][C][C]": 979,
    "[N][C][C][N][Branch2][Ring1]": 980,
    "[N][C][C][=C][Branch1]": 981,
    "[=N][N][Branch1][C][C]": 982,
    "[N][C][=C][N][=C][C][=C][Ring1][=Branch1]": 983,
    "[S][C][=C][C][=C][Branch1]": 984,
    "[C][=N][C][=N][C][Branch1][C]": 985,
    "[C][Ring2][Ring1][Branch1]": 986,
    "[C][=C][C][Branch1][=N]": 987,
    "[O][N][C][=N]": 988,
    "[=Branch2][C][=Branch1][C][=O]": 989,
    "[O][C][=C][C][=C][C][Branch2][Ring1]": 990,
    "[C][=C][C][=C][C][Branch1][S]": 991,
    "[C][S][=Branch1][C][=O][=Branch1][C][=O]": 992,
    "[C][=C][C][Branch1][C][O][=C][Branch2][Ring1]": 993,
    "[C][Ring2][Ring1][Ring2]": 994,
    "[Branch2][Ring1][Ring2][N][C][=C][C][=C][Branch1][=Branch2]": 995,
    "[Ring1][N][C][C]": 996,
    "[O][C][C][C][C]": 997,
    "[C][Ring1][=C][=C][Ring2][Ring1]": 998,
    "[N][Ring1][Branch1][C][C]": 999,
    "[#C][C][=N]": 1000,
    "[Branch1][N][C][=C][C][=C]": 1001,
    "[C][=C][C][=C][C][=C][Ring1][=Branch1][F]": 1002,
    "[C@H1][C][C][C]": 1003,
    "[Ring1][#Branch1][=N][Ring2][Ring1]": 1004,
    "[NH1][N][=C][Branch1]": 1005,
    "[C][N][Branch1][C][C][C]": 1006,
    "[N][C][=C][C][=C][Branch1][#Branch2]": 1007,
    "[Branch1][N][C]": 1008,
    "[O][C][=C][N][=C]": 1009,
    "[C@H1][Branch2][Ring1]": 1010,
    "[C@@H1][Branch2][Ring2]": 1011,
    "[Ring2][Ring1][N][C]": 1012,
    "[N][=C][Branch1][S]": 1013,
    "[O][O][=C]": 1014,
    "[N][C][C][=C][C][=C][C][=C][Ring1][=Branch1]": 1015,
    "[NH1][Ring1][Branch1]": 1016,
    "[C][Branch2][Ring1][Ring2][N][C][=C][C][=C][Branch1][=Branch2]": 1017,
    "[C][=C][C][Branch1][#C]": 1018,
    "[C][=C][N][=C][N][=C][Ring1][=Branch1]": 1019,
    "[O][=C][Branch2][Branch1]": 1020,
    "[C][Branch1][C][N][=N]": 1021,
    "[N][Ring2][Ring1][Ring1]": 1022,
    "[C][O][C][=C][C]": 1023,
    "[O][=C][Branch2][Ring2]": 1024,
    "[C][Branch1][C][Cl][=C][Ring1][S]": 1025,
    "[N][=C][NH1]": 1026,
    "[N][=C][Branch1][=N][N][C][=C][C][=C]": 1027,
    "[#Branch2][C][=C][C][=C][C][=C][Ring1][=Branch1]": 1028,
    "[N][C][C][C][C][C][Ring1][=Branch1]": 1029,
    "[N][Branch1][C][C][C][=Ring1][=Branch1]": 1030,
    "[=Branch1][Ring2][=N][Ring1][=Branch1]": 1031,
    "[C][Branch1][C][C][C]": 1032,
    "[F][=C][Ring2][Ring1]": 1033,
    "[C][Branch1][=Branch1]": 1034,
    "[C][=Ring1][=Branch1]": 1035,
    "[N][=N][Ring1]": 1036,
    "[S][Ring1][=N]": 1037,
    "[N][Ring1][#Branch1]": 1038,
    "[N][C][=C][C][=C][N][=C]": 1039,
    "[C][N][N][=C]": 1040,
    "[C][C][C][Ring1][Branch1]": 1041,
    "[N][C][=C][C][=C][Branch1][#C]": 1042,
    "[C][=Branch1][C][=O][NH1]": 1043,
    "[N][C][C][C][Branch2][Ring1]": 1044,
    "[N][C][C][=N]": 1045,
    "[Branch1][C][O-1]": 1046,
    "[O][C][C][=C][C][=C][C][=C][Ring1][=Branch1]": 1047,
    "[C][=C][C][=C][Ring1][=N][Ring1][=Branch2]": 1048,
    "[Branch2][Ring1][Ring2][C][=C][C][=C][Branch1][#Branch2]": 1049,
    "[Branch2][Ring2][=N]": 1050,
    "[P][=Branch1][C][=O]": 1051,
    "[C][=C][C][Branch1][Branch2]": 1052,
    "[NH1][C][=C][C][=C]": 1053,
    "[N][C][=C][C][=C][Branch1][C][Br]": 1054,
    "[C][N][Branch1][C][C][C][C][Ring1][#Branch1]": 1055,
    "[=N][Ring1][=N]": 1056,
    "[=N][N][C][=N]": 1057,
    "[Branch1][C][=Branch1][C][=O][C][=C][Branch1][C]": 1058,
    "[N][O]": 1059,
    "[=C][C][=C][Ring2][Ring1][Ring1]": 1060,
    "[=Branch2][Ring1][=Branch1]": 1061,
    "[S][C][=C][C][=C]": 1062,
    "[C][Branch1][C][C][Branch1][C][C][O]": 1063,
    "[C][=C][C][Branch1][=C]": 1064,
    "[S][=Branch1][C][=O][=Branch1][C][=O][N][C][C]": 1065,
    "[Cl][C]": 1066,
    "[N][Branch1][#Branch1]": 1067,
    "[=N][NH1][C][=Ring1]": 1068,
    "[=C][C][=C][Ring1][#C]": 1069,
    "[N][C][=Branch1][C][=O][C][=C][C][=C][C][=C][Ring1][=Branch1]": 1070,
    "[C][Branch2][Ring1][#C]": 1071,
    "[C][=C][C][Ring1][=Branch1][=C][Ring1][#Branch2]": 1072,
    "[C][Ring1][O]": 1073,
    "[Ring1][O][=C]": 1074,
    "[C][=C][N][=C][Branch1][C][N][C]": 1075,
    "[Branch1][C][I]": 1076,
    "[=N][C][=Ring2]": 1077,
    "[=Ring1][Branch2]": 1078,
    "[C][=C][N][=C][NH1]": 1079,
    "[=N][N][C]": 1080,
    "[C][=C][C][Branch1][C][F][=C][C][=C][Ring1][#Branch1]": 1081,
    "[C][=N][N]": 1082,
    "[C][Branch1][=N][N][C][=C][C][=C]": 1083,
    "[C][=N][Ring2][Ring1][Ring2]": 1084,
    "[N][C][=Branch1][C][=O][C@@H1]": 1085,
    "[Ring1][C][=C][C][=C][Branch1][=Branch2]": 1086,
    "[N][C][=Branch1][C][=O][C][C]": 1087,
    "[Branch2][Branch1][Branch2]": 1088,
    "[C][Branch2][Ring1][N]": 1089,
    "[=N][S]": 1090,
    "[O][C][Branch1][C][F][F]": 1091,
    "[N][Ring1][Branch2]": 1092,
    "[=Branch1][N+1][=Branch1][C][=O][O-1]": 1093,
    "[C@@][Branch1][C][C]": 1094,
    "[C][=C][C][Branch1][#Branch2]": 1095,
    "[N][C][=C][C][=C][Branch1][C][O][C][=C][Ring1][#Branch1]": 1096,
    "[N][Branch1][S][C]": 1097,
    "[P][C][=C][C][=C]": 1098,
    "[Branch2][Ring2][#C]": 1099,
    "[N][C][=C][Ring2][Ring1]": 1100,
    "[C][=C][C][=C][Branch2][Ring1][C]": 1101,
    "[=Branch1][C][Branch1][C][N][=O][=C]": 1102,
    "[Ring1][=Branch1][C][=Branch1][C][=O][N][C]": 1103,
    "[N][C][C][N][Branch2]": 1104,
    "[N][Branch1][=Branch1][C][Branch1][C][C]": 1105,
    "[/C][=C][\\C][=Branch1][C][=O][N][C][=C][C][=C]": 1106,
    "[C][=N][C][=C][N][=C]": 1107,
    "[Branch1][Ring1][O][C]": 1108,
    "[C][=C][C][Branch1][N]": 1109,
    "[C][=Branch1][C][=O][N][Branch1][C][C]": 1110,
    "[Branch1][C][O][C][C][Ring1][#Branch1]": 1111,
    "[N][=C][N][Ring1]": 1112,
    "[C][=C][C][=C][C][Ring1][=Branch1][=C][Ring1][#Branch2]": 1113,
    "[N][Branch1][Branch2][C][C][C][C][C][Ring1][Branch1][C]": 1114,
    "[N][C][=C][Branch1][C][Cl]": 1115,
    "[C][=C][C][=Branch1]": 1116,
    "[C][=C][C][=C][C][=C][Branch1]": 1117,
    "[C][C][Ring2][Ring1][S]": 1118,
    "[=Ring2][Ring1][#Branch2]": 1119,
    "[C][=Branch1][C][=O][N][C][Ring1][S]": 1120,
    "[Branch2][Branch1][C]": 1121,
    "[N][=C][Branch1][#Branch2]": 1122,
    "[C][=C][N][=C][C][=C][C][Branch2][Ring1]": 1123,
    "[C][=C][C][=C][C][=N][C][=C][Ring1][=Branch1]": 1124,
    "[Branch1][C][C][C][=C][Ring1][#Branch1]": 1125,
    "[=N][C][N][C][C][N][Branch1][C][C][C][C][Ring1][#Branch1]": 1126,
    "[=N][C][Ring2][Ring1]": 1127,
    "[C][=C][C][=N][C][Branch1][#Branch2]": 1128,
    "[C][C][C][C][C@@H1]": 1129,
    "[C][=C][Branch1][=Branch1]": 1130,
    "[C][=C][C][=C][C][Branch1][=Branch2][C][Branch1][C][F][Branch1][C][F][F][=C][Ring1][#Branch2]": 1131,
    "[Ring1][N][=C]": 1132,
    "[C][=C][C][=C][Branch2][Ring1][P]": 1133,
    "[#C][C][O]": 1134,
    "[Branch2][C][C][C]": 1135,
    "[=Branch1][C][=Branch1][C][=O][O]": 1136,
    "[=Branch2][C][Branch1][C][F][Branch1][C][F][F][=C]": 1137,
    "[C][=Branch1][C][=O][C][=Ring1]": 1138,
    "[C][C][C][C@H1]": 1139,
    "[C][=C][C][NH1][C][=C][C]": 1140,
    "[C][=C][C][Branch2][Branch1]": 1141,
    "[C][C][=N][C][=N]": 1142,
    "[=C][C][=C][Ring1][S]": 1143,
    "[=N][Ring2][Ring1][=Branch1][C]": 1144,
    "[C][=C][Ring2][Ring1][O][C]": 1145,
    "[C][C][=C][C][=C][Branch2][Ring1]": 1146,
    "[N][C][=Branch1][C][=O][C][C][=N]": 1147,
    "[=Ring1][S]": 1148,
    "[C][=C][C][Branch1][C][Br]": 1149,
    "[O][C][#C]": 1150,
    "[C][N][Branch1][C][C][C][C][C]": 1151,
    "[C@@H1][C][C][C]": 1152,
    "[C][C][Ring1][S]": 1153,
    "[C][O][C][=C][C][=C][C][=C][Ring1][=Branch1]": 1154,
    "[N][=C][N][Branch1][C][C][C][=Branch1][C][=O]": 1155,
    "[O][N][C][=C][C][=C][C][=C][Ring1][=Branch1]": 1156,
    "[C][O][C][=N]": 1157,
    "[Branch1][N][C][C]": 1158,
    "[Branch1][C][O][=C][Ring2][Ring1][Ring2]": 1159,
    "[O][N][C][=Branch1][C][=O][C][C][C][Ring1][Ring1]": 1160,
    "[N][=C][Ring2][Ring1][Ring2]": 1161,
    "[Branch1][Ring1][C][#N]": 1162,
    "[C][N][Branch1][C][C][C][=Branch1][C][=O]": 1163,
    "[NH1][C][=C][C][Ring1][Branch1][=C][Ring1][=Branch2]": 1164,
    "[=C][C][=C][C]": 1165,
    "[C][C][C][N][C][=Branch1][C][=O]": 1166,
    "[C][=C][C][=C][Branch1][#Branch1]": 1167,
    "[C][=C][C][=N][C][=C][Ring1][=Branch1][N][C][=Branch1][C][=O]": 1168,
    "[=C][Ring2][Ring1][S]": 1169,
    "[Ring1][=Branch1][C][=Ring1]": 1170,
    "[=C][Branch1][=Branch2]": 1171,
    "[C][Ring1][#C][=C][Ring2][Ring1][Ring1]": 1172,
    "[N][=C][Ring1][=Branch1][C]": 1173,
    "[C][=C][C][=C][Ring1][=Branch1][C]": 1174,
    "[NH1][N][=C][C][Ring1][Branch1][=C][Ring1][=Branch2]": 1175,
    "[C][=C][Branch1][Ring1][O][C]": 1176,
    "[C][=C][C][=C][N][Ring1][=Branch2]": 1177,
    "[C][=C][C][=C][C][=Branch1][Ring2][=C][Ring1][=Branch1][O][C][O]": 1178,
    "[C][=C][C][=C][Branch1][N]": 1179,
    "[C][N][C][=C]": 1180,
    "[C][=C][Ring1][#Branch1][Cl]": 1181,
    "[Branch1][C][Cl][C][=C][C][=C][Ring1][#Branch1][Cl]": 1182,
    "[C][Ring1][Branch2]": 1183,
    "[N][C][C][N][C][C][Ring1][=Branch1]": 1184,
    "[C][=C][C][Branch2][Ring2][=Branch2]": 1185,
    "[Branch2][Ring1][=Branch1][N][C][=C][C][=C][Branch1]": 1186,
    "[#Branch2][N][C][=Branch1][C][=O]": 1187,
    "[Ring1][N][C][=Branch1][C][=O]": 1188,
    "[C][=C][C][=C][C][Branch1][#Branch2]": 1189,
    "[C][C][C][C][Ring1][=Branch1]": 1190,
    "[C@@H1][Branch1][C][O][C]": 1191,
    "[Branch1][C][O][C][Branch1][C][O]": 1192,
    "[N][/N]": 1193,
    "[Ring2][Ring1][O][C]": 1194,
    "[Ring2][=C]": 1195,
    "[N][Ring2][Ring1][=Branch1]": 1196,
    "[C][Branch2][Ring1][C]": 1197,
    "[C][C][O][C][=C][C][=N]": 1198,
    "[C@H1][Branch1][C][N][C]": 1199,
    "[C][=C][C][=C][Branch1][Branch2]": 1200,
    "[C][=C][Branch1][=Branch2][C][=C][C][=C][C][=C][Ring1][=Branch1]": 1201,
    "[Branch2][Branch1][=Branch2]": 1202,
    "[Ring2][Ring1][Branch1][C]": 1203,
    "[C][C][=C][C][=C][Branch1]": 1204,
    "[=Ring2][Ring1][#Branch1]": 1205,
    "[C][N][C][=C][Branch2][Ring1]": 1206,
    "[Ring1][=Branch1][C][=C][Ring1][#C]": 1207,
    "[=C][N][Ring2][Ring1]": 1208,
    "[C][=Ring1][=Branch2]": 1209,
    "[=Branch1][N][Branch1][C][C]": 1210,
    "[C][Branch1][C][C][C][C]": 1211,
    "[Branch2][C][C][=C]": 1212,
    "[Ring2][C][Ring1]": 1213,
    "[C][=C][C][=C][C][=Branch1][Ring2][=C][Ring1][=Branch1][C]": 1214,
    "[C][=Ring1][#Branch2]": 1215,
    "[N][C][=Branch1][C][=O][C@H1]": 1216,
    "[C][=C][C][=N][C]": 1217,
    "[Branch2][Ring2][#Branch1][C][=C][C][=N][C][=C][Ring1][=Branch1]": 1218,
    "[Ring1][Branch1][C][O]": 1219,
    "[C][=C][C][=C][C][Branch1][C][Cl][=C][Ring1][#Branch1]": 1220,
    "[N][C][=Branch1][C][=O][N][C][=C][C][=C][Branch1]": 1221,
    "[Ring2][Ring2][#Branch1]": 1222,
    "[N][C][=C][Branch1][Ring1][C][#N][C][=N]": 1223,
    "[N][C][=N][C][=C][C][Branch2][Ring2]": 1224,
    "[C][=N][C][=N][C][NH1][C][=C][C][Ring1][=Branch2]": 1225,
    "[C][Ring2][Ring1][=C]": 1226,
    "[C][=C][Ring1][=C][Ring1][#Branch2]": 1227,
    "[Branch1][P]": 1228,
    "[C][C][C][Ring1][Ring1][=C]": 1229,
    "[C][=C][C][=N][C][=C][Ring1][=Branch1][C]": 1230,
    "[=Branch1][C][O]": 1231,
    "[=C][C][Branch1][C][F]": 1232,
    "[C@H1][Branch1][C][O][C]": 1233,
    "[C][=C][C][=C][Branch2][Ring1][Ring2]": 1234,
    "[=N][Ring1][=Branch2]": 1235,
    "[N][Ring1][#Branch2]": 1236,
    "[N][C][=Branch1][C][=O][C][=C][C][Branch1]": 1237,
    "[N][C][=C][C][=C][Branch1][=C][O][C]": 1238,
    "[NH1][C][Ring2][Ring1]": 1239,
    "[N][=C][C]": 1240,
    "[C][C][Ring2][Ring1][=Branch1]": 1241,
    "[N][Ring2][Ring1][#Branch1]": 1242,
    "[Branch1][C][N][N][=C]": 1243,
    "[C][=C][C][=C][C][Branch2][Branch1]": 1244,
    "[C][=N][C][=C][Ring1][=Branch1]": 1245,
    "[O][C][C][Ring1][=Branch2]": 1246,
    "[O][C][=C][Branch1]": 1247,
    "[C][=C][C][=C][C][Branch2][Ring1][=Branch2]": 1248,
    "[=Branch1][C][=N][N]": 1249,
    "[S][C][=C]": 1250,
    "[N][Ring2][Ring1][Branch2]": 1251,
    "[C][=C][NH1][C][=N]": 1252,
    "[N][C][=N][C][=C][Branch1][=Branch2][C][Branch1][C][F][Branch1][C][F][F]": 1253,
    "[C][Branch1][=Branch2][N][C][C][O][C][C][Ring1][=Branch1]": 1254,
    "[C][O][C][=Branch1][C][=O]": 1255,
    "[O][C][C][C][N][C][C][N][Branch1][C][C][C][C][Ring1][#Branch1]": 1256,
    "[C][=C][N][=C][C][Branch1]": 1257,
    "[C][=C][C][=C][N][N][=C]": 1258,
    "[N][=C][Branch1][=C]": 1259,
    "[=Ring2][Ring1][Ring2]": 1260,
    "[C][Ring1][#C][=O]": 1261,
    "[=C][Branch1][C][Cl]": 1262,
    "[O][C][C][Branch1][C][C]": 1263,
    "[=C][C][=C][Ring2][Ring1][#Branch1]": 1264,
    "[N][N][=C][Branch1][=Branch2]": 1265,
    "[N][C][=Branch1][C][=O][C][=C]": 1266,
    "[N][Ring2][Ring1][=Branch2]": 1267,
    "[Branch1][C][F][Branch1][C][F][F][=C][Ring1][#C]": 1268,
    "[Branch2][Ring2][N]": 1269,
    "[C][O][C][=C][C][=C][C][Branch2][Ring1]": 1270,
    "[N][C][Branch2][Ring1][#Branch2]": 1271,
    "[=Branch1][C][=O][=O][C][=C][Ring1][#Branch2]": 1272,
    "[N][C@@H1][Branch1][C][C]": 1273,
    "[C][=C][C][=C][Branch2][Ring1][Branch1]": 1274,
    "[O][=C][Branch1][#Branch2]": 1275,
    "[C][=C][Branch2][Ring1][Branch2]": 1276,
    "[Ring1][C][#N][C][=C][Ring1][Branch2]": 1277,
    "[N][C][=C][C][=C][C][=C][Ring1][=Branch1][S][=Branch1][C][=O][=Branch1][C][=O]": 1278,
    "[N][=C][Ring1][=N]": 1279,
    "[Ring1][=Branch1][C][=Branch1][C][=O]": 1280,
    "[C][Ring2][Ring1][=Branch2]": 1281,
    "[N][C][=C][C][=C][C][=C][Ring1][=Branch1][C][=C][C][=Branch2]": 1282,
    "[C][=C][C][=Branch2][Ring1][#Branch1][=C]": 1283,
    "[C][=C][C][=C][Branch2][Ring2][#Branch1]": 1284,
    "[N][Branch1][Ring2][C][C]": 1285,
    "[N][O][=C]": 1286,
    "[C][=C][N][=C][Branch1][#Branch2]": 1287,
    "[C][=C][C][=C][Branch2]": 1288,
    "[=Branch2][C][Branch1][C][F][Branch1][C][F][F][C][=C][Ring1][#Branch2]": 1289,
    "[C][Ring1][=Branch2][=Ring1][Branch1]": 1290,
    "[C][O][C][C][C]": 1291,
    "[O][C][Branch1][C][C][Branch1][C][C]": 1292,
    "[S][C][=N][C][Branch1]": 1293,
    "[Branch1][C][C][O]": 1294,
    "[O][C][C][Ring1][=Branch1][C]": 1295,
    "[=Branch1][C][C][C][Ring1]": 1296,
    "[O][C][=C][C][=C][C][=C][Ring1][=Branch1][C][=C][Ring1][=N]": 1297,
    "[=C][Ring2][Ring1][Branch1][C]": 1298,
    "[=Branch2][C][=C][C][=C][C][=N]": 1299,
    "[=N][N][C@H1][C][C][C@H1]": 1300,
    "[N][Branch1][=Branch2][C][=C][C][=C][C][=C][Ring1][=Branch1]": 1301,
    "[=C][C][=N][N][=C]": 1302,
    "[C][=C][Ring2][Ring1][Ring1][O]": 1303,
    "[C@@H1][Branch1][Ring1][C][#N]": 1304,
    "[O][N]": 1305,
    "[Branch1][C][N][N][=C][N][=C][Ring1][#Branch1]": 1306,
    "[C][=C][C][Branch2][Ring2][Branch2]": 1307,
    "[C][=C][Ring1][Branch1]": 1308,
    "[N][C][=Branch1][C][=O][/C][Ring1][#Branch1][=C]": 1309,
    "[Ring2][Ring2][Branch2]": 1310,
    "[N][=C][Branch1][C][N]": 1311,
    "[O][=C][Branch1][O]": 1312,
    "[=C][N][Ring1]": 1313,
    "[C][=C][C][=C][Branch1][#Branch2][C]": 1314,
    "[C][=C][Branch1][#Branch1]": 1315,
    "[C][=C][C][Branch2][Ring1][=Branch1]": 1316,
    "[=C][Branch1][C]": 1317,
    "[C][=C][C][=C][C][=N][Ring1][=Branch1]": 1318,
    "[C][=C][C][=C][C][=C]": 1319,
    "[Branch2][Ring2][Ring1][C]": 1320,
    "[C][=C][Branch1][=Branch2][C][Branch1][C][C][Branch1][C][C]": 1321,
    "[N][C][=C][C][=C][C][Branch1][=Branch2][C][Branch1][C][F][Branch1][C][F][F][=C][Ring1][#Branch2]": 1322,
    "[N][C][=Branch1][C][=O][C][=N]": 1323,
    "[N][C][Branch1][=Branch2]": 1324,
    "[N][C][S]": 1325,
    "[N][C][Ring1][=Branch1]": 1326,
    "[C][=C][C][=C][Branch2][Ring1][=C]": 1327,
    "[C][=C][C][=C][NH1][N][=C]": 1328,
    "[NH1][C][=C][C][Ring1][=Branch2][=Ring1][Branch1]": 1329,
    "[C][O][C][=C][C][=C][C][Branch2][Ring2]": 1330,
    "[=N][Ring2][Ring1][#C]": 1331,
    "[C][=Ring1][Branch2]": 1332,
    "[Ring1][=Branch1][C][=C][Ring1][N]": 1333,
    "[C][O][C][=C][C][=C][C]": 1334,
    "[=Branch2][C][=C][C][=C][N][=C]": 1335,
    "[C][=C][Ring2][Ring1][N][C]": 1336,
    "[C][N][Branch1][=C]": 1337,
    "[N][C][C][Branch1][C][C]": 1338,
    "[C][N][Branch2][Ring2]": 1339,
    "[Branch1][C][N][=N]": 1340,
    "[N][=C][Ring1][Branch1][C]": 1341,
    "[N][C][=N][C][Branch2][Ring2]": 1342,
    "[C][Ring2][Ring1][O]": 1343,
    "[=S][=Branch1][C][=O]": 1344,
    "[N][=C][Ring2][Ring1][Branch2]": 1345,
    "[Branch1][C][O][=C][Ring1][Branch2]": 1346,
    "[=C][C][=Ring1]": 1347,
    "[C][=C][C][=C][C][Branch2][Ring1][Ring2]": 1348,
    "[C][C][C][N][C][C][Ring1][=Branch1][C]": 1349,
    "[N][=C][C][=C][Ring2][Ring1]": 1350,
    "[=C][C][=Branch1]": 1351,
    "[N][Branch1][C][C][C][=N]": 1352,
    "[N][C][=C][C][=C][C][Branch1][C]": 1353,
    "[C][=Branch1][C][=O][C][=C][N][=C]": 1354,
    "[C][C][O][C][=C][C][=C]": 1355,
    "[C][N][C][=C][Branch2][Ring2]": 1356,
    "[O][=C][Ring2][Ring1]": 1357,
    "[C][=C][C][=C][Branch2][Ring1][Ring1]": 1358,
    "[C][=C][C][=C][C][=C][Ring2][Ring1]": 1359,
    "[C][=C][C][=C][Branch2][Ring2][Ring2]": 1360,
    "[S][C][=C][N][=C]": 1361,
    "[S][N][C]": 1362,
    "[C][=C][C][=C][C][Branch1][=Branch2]": 1363,
    "[C][=C][Ring1][=Branch1][F]": 1364,
    "[C][=O]": 1365,
    "[N][N][C][C][N][Branch1][C][C][C][C][Ring1][#Branch1][C][=C][Ring1][=N]": 1366,
    "[C][=C][C][=C][Ring1][=Branch2]": 1367,
    "[=C][Ring1][N]": 1368,
    "[N][=C][N][=C][Ring1]": 1369,
    "[C][=C][C][Branch2][Ring1][S]": 1370,
